{
    "1:1": "1.1 Dhritarashtra said What did my people and the sons of Pandu do when they had assembled together eager for battle on the holy plain of Kurukshetra, O Sanjaya.",
    "1:2": "1.2. Sanjaya said  Having seen the army of the Pandavas drawn up in battle-array,\nKing Duryodhana then approached his teacher (Drona) and spoke these words.",
    "1:3": "1.3. \"Behold, O Teacher! this mighty army of the sons of Pandu,\narrayed by the son of Drupada, thy wise disciple.",
    "1:4": "1.4. Here are heroes, mighty archers, eal in battle to Bhima\nand Arjuna, Yoyudhana (Satyaki), Virata and Drupada, of the great car (mighty\nwarriors).",
    "1:5": "1.5. \"Dhrishtaketu, chekitana and the valiant king of Kasi, Purujit\nand Kuntibhoja and Saibya, the best men.",
    "1:6": "1.6. \"The strong Yodhamanyu and the brave Uttamaujas, the son\nof Subhadra (Abhimanyu, the son of Subhadra and Arjuna), and the sons of\nDraupadi, all of great chariots (great heroes).",
    "1:7": "1.7. \"Know also, O best among the twice-born! the names of those\nwho are the most distinguished amongst ourselves, the leaders of my army;\nthese I name to thee for thy information.",
    "1:8": "1.8. \"Thyself and Bhishma, and Karna and also Kripa, the victorious\nin war, Asvatthama, Vikarna, and also Bhurisrava, the son of Somadatta.",
    "1:9": "1.9. \"And also many other heroes who are ready to give up their\nlives for my sake, armed with various weapons and missiles, all well-skilled\nin battle.",
    "1:10": "1.10. \"This army of ours marshalled by Bhishma is insufficient,\nwhereas that army of theirs marshelled by Bhima is sufficient.",
    "1:11": "1.11. \"Therefore do ye all, stationed in your respective positions,\nin the several divisions of the army, protect Bhishma alone.\"",
    "1:12": "1.12. His glorious grandsire (Bhishma), the oldest of the Kauravas,\nin order to cheer Duryodhana, now roared like a lion, and blew his conch.",
    "1:13": "1.13. Then (following Bhishma), conches and kettledrums, tabors,\ndrums and cow horns blared forth ite suddenly (from the Kaurava side)\nand the sound was tremendous.",
    "1:14": "1.14. Then, also, Madhava (Krishna) and the son of Pandu (Arjuna),\nseated in the magnificent chariot, yoked with white horses, blew divine\nconches.",
    "1:15": "1.15. Hrishikesha blew the Panchajanya and Arjuna blew the Devadatta\nand Bhima (the wolf-bellied), the doer of terrible deeds, blew the great\nconch Paundra.",
    "1:16": "1.16. The king Yodhishthira, the son of Kunti, blew the Anantavijaya;\nNakula and Sahadeva blew the Sughosha and the Manipushpaka.",
    "1:17": "1.17. The king of Kasi, an exellent archer, Sikhandi, the mighty\ncar-warrior, Dhrishtadyumna and Virata and Satyaki, the unconered.",
    "1:18": "1.18. Drupada and the sons of Draupadi, O Lord of the earth, and\nthe son of Subhadra, the mighty-armed, blew their conches separately.",
    "1:19": "1.19. That tumultuous sound rent the hearts of (the members of)\nDhritarashtra's party, making both the heaven and the earth resound.",
    "1:20": "1.20. Then, seeing the people of Dhritarashtra’s party standing\narrayed and the discharge of weapons about to begin, Arjuna, the son of\nPandu, whose ensign was a monkey, took up his bow and said the following\nto Krishna, O Lord of the earth.",
    "1:21": "1.21 Arjuna said  In the middle between the two armies, place my chariot,\nO krishna, so that I may behold those who stand here desirous to fight,\nand know with whom I must fight, when the battle is about to commence.",
    "1:22": "1.22. Arjuna said  In the middle between the two armies, place my chariot,\nO krishna, so that I may behold those who stand here desirous to fight,\nand know with whom I must fight, when the battle is about to commence.",
    "1:23": "1.23. For I desire to observe those who are assembled here to fight,\nwishing to please in battle the evil-minded Duryodhana (the son of Dhritarashtra).",
    "1:24": "1.24. Sanjaya said  Thus addressed by Arjuna, Krishna, having stationed that\nbest of chariots, O Dhritarashtra, in the midst of the two armies.",
    "1:25": "1.25. In front of Bhishma and Drona, and all the rulers of the\nearth, said: \"O Arjuna (son of Pritha), behold these Kurus gathered together.\"",
    "1:26": "1.26. Then, Arjuna (son of Pritha) saw there (in the armies) stationed,\nfathers and grandfathers, teachers, maternal uncles, brothers, sons, grandsons\nand friends too.",
    "1:27": "1.27. (He saw) fathers-in-law and friends also in both the armies.\nThe son of Kunti, Arjuna, seeing all those kinsmen thus standing arrayed,\nspoke this, sorrowfully filled with deep pity.",
    "1:28": "1.28. Arjuna said  Seeing these, my kinsmen, O krishna, arrayed, eager to fight.",
    "1:29": "1.29. My limbs fail and my mouth is parched, my body ivers and\nmy hair stands on end.",
    "1:30": "1.30. The (bow) Gandiva slips from my hand, and also my skins burns\nall over; I am unable even to stand and my mind is reeling, as it were.",
    "1:31": "1.31. And I see adverse omens, O Kesava. I do not see any good\nin killing my kinsmen in battle.",
    "1:32": "1.32. I desire not victory, O Krishna, nor kingdom, nor pleasures.\nOf what avail is dominion to us, O Krishna, or pleasures or even life?",
    "1:33": "1.33. Those for whose sake we desire kingdom, enjoyments and pleasures,\nstand here in battle, having renounced life and wealth.",
    "1:34": "1.34. Teachers, fathers, sons and also grandfathers, maternal uncles,\nfathers-in-law, grandsons, brothers-in-law and other relatives,-",
    "1:35": "1.35. These I do not wish to kill, though they kill me, O Krishna,\neven for the sake of dominion over the three worlds; leave alone killing\nthem for the sake of the earth.",
    "1:36": "1.36. By killing these sons of Dhritarashtra, what pleasure can\nbe ours, O Janardana? Only sin will accrue to us from killing these felons.",
    "1:37": "1.37. Therefore, we should not kill the sons of Dhritarashtra,\nour relatives; for how can we be happy by killing our own people, O Madhava\n(Krishna)?",
    "1:38": "1.38. Though they, with intelligence overpowered by greed, see\nno evil in the destruction of families, and no sin in hostility to friends,",
    "1:39": "1.39. Why should not we who clearly see evil in the destruction\nof families, learn to turn away from this sin, O Janardana (Krishna)?",
    "1:40": "1.40. In the destruction of a family, the immemorial religious\nrites of that family perish; on the destruction of spirituality, impiety,\nindeed, overcomes the whole family.",
    "1:41": "1.41. By the prevalence of impiety, O Krishna, the women of\nthe family become corrupt; and , women being corrupted, O Varshenya (descendant\nof Vrishni), there arises intermingling of castes.",
    "1:42": "1.42. Confusion of castes leads to hell the slayers of the family,\nfor their forefathers fall, deprived of the offerings of rice-ball and\nwater (libations).",
    "1:43": "1.43. By these evil deeds of the destroyers of the family, which\ncause confusion of castes, the eternal religious rites of the caste and\nthe family are destroyed.",
    "1:44": "1.44. We have heard, O Janardana, that inevitable is the dwelling\nfor an unknown period in hell for those men in whose families the religious\npractices have been destroyed.",
    "1:45": "1.45. Alas! We are involved in a great sin, in that we are\nprepared to kill our kinsmen, through greed for the pleasures of a kingdom.",
    "1:46": "1.46. If the sons of Dhritarashtra with weapons in hand should\nslay me in battle, unresisting and unarmed, that would be better for me.",
    "1:47": "1.47. Sanjaya said  Having thus spoken in the midst of the battlefield, Arjuna,\ncasting away his bow and arrow, sat down on the seat of the chariot with\nhis mind overwhelmed with sorrow.",
    "2:1": "2.1 Sanjaya said  To him who was thus overcome with pity and who was despondent, with eyes full of tears and agitated, Madhusudana (the destroyer of Madhu) or Krishna spoke these words.",
    "2:2": "2.2 The Blessed Lord said  Whence is this perilous strait come upon thee, this dejection which is unworthy of you, disgraceful, and which will close the gates of heaven upon you, O Arjuna?",
    "2:3": "2.3 Yield not to impotence, O Arjuna, son of Pritha. It does not befit thee. Cast off this mean weakness of the heart! Stand up, O scorcher of the foes!",
    "2:4": "2.4 Arjuna said  How, O Madhusudana, shall I fight in battle with arrows against Bhishma and Drona, who are fit to be worshipped, O destroyer of enemies?",
    "2:5": "2.5 Better it is, indeed, in this world to accept alms than to slay the most noble teachers. But if I kill them, even in this world all my enjoyments of wealth and fulfilled desires will be stained with (their) blood.",
    "2:6": "2.6 I can hardly tell which will be better, that we should  coner them or that they should coner us. Even the sons of Dhritarashtra, after slaying whom we do not wish to live, stand facing us.",
    "2:7": "2.7 My heart is overpowered by the taint of pity; my mind is confused as to duty. I ask Thee: Tell me decisively what is good for me. I am Thy disciple. Instruct me who has taken refuge in Thee.",
    "2:8": "2.8 I do not see that it would remove this sorrow that burns up my senses, even if I should attain prosperous and unrivalled dominion on earth or lordship over the gods.",
    "2:9": "2.9 Sanjaya said  Having spoken thus to Hrishikesha (the Lord of the senses), Arjuna (the coneror of sleep), the destroyer of foes, said to Krishna, \"I will not fight\" and became silent.",
    "2:10": "2.10 To him who was despondent in the midst of the two armies, Krishna, as if smiling, O Bharata, spoke these words.",
    "2:11": "2.11 The Blessed Lord said  Thou hast grieved for those that should not be grieved for, yet thou speakest words of wisdom. The wise grieve neither for the living nor for the dead.",
    "2:12": "2.12 Nor at any time indeed was I not, nor thou, nor these rulers of men, nor verily shall we ever cease to be hereafter.",
    "2:13": "2.13 Just as in this body the embodied (soul) passes into childhood, youth and old age, so also does it pass into another body; the firm man does not grieve thereat.",
    "2:14": "2.14 The contacts of the senses with the objects, O son of Kunti, which cause heat and cold, pleasure and pain, have a beginning and an end; they are impermanent; endure them bravely, O Arjuna.",
    "2:15": "2.15 That firm man whom, surely, these afflict not, O chief among men, to whom pleasure and pain are the same, is fit for attaining immortality.",
    "2:16": "2.16 The unreal hath no being; there is non-being of the real; the truth about both has been seen by the knowers of the Truth (or the seers of the Essence).",
    "2:17": "2.17 Know that to be indestructible, by Which all this is pervaded. None can cause the destruction of That, the Imperishable.",
    "2:18": "2.18 These bodies of the embodied Self, Which is eternal, indestructible and immeasurable, are said to have an end. Therefore fight, O Arjuna.",
    "2:19": "2.19 He who takes the Self to be the slayer and he who thinks It is slain, neither of them ï1knowsï1. It slays not, nor is It slain.",
    "2:20": "2.20 It is not born, nor does It ever die; after having been, It again ceases not to be; unborn, eternal, changeless and ancient, It is not killed when the body is killed.",
    "2:21": "2.21 Whosoever knows It to be indestructible, eternal, unborn and inexhaustible, how can that man slay, O Arjuna, or cause to be slain?",
    "2:22": "2.22 Just as a man casts off worn-out clothes and puts on new ones, so also the embodied Self casts off worn-out bodies and enters others which are new.",
    "2:23": "2.23 Weapons cut It not, fire burns It not, water wets It not, wind dries It not.",
    "2:24": "2.24 This Self cannot be cut, burnt, wetted, nor dried up. It is eternal, all-pervading, stable, immovable and ancient.",
    "2:25": "2.25 This (Self) is said to be unmanifested, unthinkable and unchangeable. Therefore, knowing This to be such, thou shouldst not grieve.",
    "2:26": "2.26 But even if thou thinkest of It as being constantly born and constantly dying, even then, O mighty-armed, thou shouldst not grieve.",
    "2:27": "2.27 For certain is death for the born, and certain is birth for the dead; therefore, over the inevitable thou shouldst not grieve.",
    "2:28": "2.28 Beings are unmanifested in their beginning, manifested in their middle state, O Arjuna, and unmanifested again in their end. What is there to grieve about?",
    "2:29": "2.29 One sees This (the Self) as a wonder; another speaks of It as a wonder; another hears of It as a wonder; yet having heard, none understands It at all.",
    "2:30": "2.30 This, the Indweller in the body of everyone, is ever indestructible, O Arjuna; therefore, thou shouldst not grieve for any creature.",
    "2:31": "2.31 Further, having regard to thy duty, shouldst not waver, for there is nothing higher for a Kshatriya than a righteous war.",
    "2:32": "2.32 Happy are the Kshatriyas, O Arjuna! who are called upon to fight in such a battle that comes of itself as an open door to heaven.",
    "2:33": "2.33 But if thou wilt not fight this righteous war, then having abandoned thine own duty and fame, thou shalt incur sin.",
    "2:34": "2.34 People, too, will recount thy everlasting dishonour; and to one who has been honoured, dishonour is worse than death.",
    "2:35": "2.35 The great car-warriors will think that thou hast withdrawn from the battle through fear; and thou wilt be lightly held by them who have thought much of thee.",
    "2:36": "2.36 Thy enemies also, cavilling at thy power, will speak many abusive words. What is more painful than this?",
    "2:37": "2.37 Slain, thou wilt obtain heaven; victorious, thou wilt enjoy the earth; therefore, stand up, O son of Kunti, resolved to fight.",
    "2:38": "2.38 Having made pleasure and pain, gain and loss, victory and defeat the same, engage thou in battle for the sake of battle; thus thou shalt not incur sin.",
    "2:39": "2.39 This, which has been taught to thee, is wisdon concerning Sankhya. Now listen to wisdom concerning Yoga, endowed with which, O Arjuna, thou shalt cast off the bonds of action.",
    "2:40": "2.40 In this there is no loss of effort, nor is there any harm (production of contrary results or transgression). Even a little of this knowledge (even a little practice of this Yoga) protects one from great fear.",
    "2:41": "2.41 Here, O joy of the Kurus, there is but a single one-pointed determination; many-branched and endless are the thoughts of the irresolute.",
    "2:42": "2.42 Flowery speech is uttered by the unwise, taking pleasure in the eulogising words of the Vedas, O Arjuna, saying, \"There is nothing else.\"",
    "2:43": "2.43 Full of desires, having heaven as their goal, (they utter speech which is directed to ends) leading to new births as the result of their works, and prescribe various methods abounding in specific actions, for the attainment of pleasure and power.",
    "2:44": "2.44 For those who are attached to pleasure and power, whose minds are drawn away by such teaching, ï1thatï1 determinate reason is not formed which is steadily bent on meditation and Samadhi (superconscious state).",
    "2:45": "2.45 The Vedas deal with the three attributes (of Nature); be thou above these three attributes. O Arjuna, free yourself from the pairs of opposites, and ever remain in the ality of Sattva (goodness), freed from (the thought of) acisition and preservation, and be established in the Self.",
    "2:46": "2.46 To the Brahmana who has known the Self, all the Vedas are of as much use as is a reservoir of water in a place where there is a flood.",
    "2:47": "2.47 Thy right is to work only, but never with its fruits; let not the fruits of action be thy motive, nor let thy attachment be to inaction.",
    "2:48": "2.48 Perform action, O Arjuna, being steadfast in Yoga, abandoning attachment and balanced in success and failure. Evenness of mind is called Yoga.",
    "2:49": "2.49 Far lower than the Yoga of wisdon is action, O Arjuna. Seek thou refuge in wisdom; wretched are they whose motive is the fruit.",
    "2:50": "2.50 Endowed with wisdom (evenness of mind), one casts off in this life both good and evil deeds; therefore, devote thyself to Yoga; Yoga is skill in action.",
    "2:51": "2.51 The wise, possessed of knowledge, having abandoned the fruits of their actions, and being freed from the fetters of birth, go to the place which is beyond all evil.",
    "2:52": "2.52 When thy intellect crosses beyond the mire of delusion, then thou shalt attain to indifference as to what has been heard and what has yet to be heard.",
    "2:53": "2.53 When thy intellect, which is perplexed by the Veda text, which thou hast read, shall stand immovable and steady in the Self, then thou shalt attain Self-realisation.",
    "2:54": "2.54 Arjuna said  What, O Krishna, is the description of him who has steady wisdom, and is merged in the superconscious state? How does one of steady wisdom speak, how does he sit, how does he walk?",
    "2:55": "2.55 The Blessed Lord said  When a man completely casts off, O Arjuna, all the desires of the mind and is satisfied in the Self by the Self, then is he said to be one of steady wisdom.",
    "2:56": "2.56 He whose mind is not shaken by adversity, who does not hanker after pleasures, and is free from attachment, fear and anger, is called a sage of steady wisdom.",
    "2:57": "2.57 He who is everywhere without attachment, on meeting with anything good or bad, who neither rejoices not hastes, his wisdom is fixed.",
    "2:58": "2.58 When, like the tortoise which withdraws on all sides its limbs, he withdraws his senses from the sense-objects, then his wisdom becomes steady.",
    "2:59": "2.59 The objects of the senses turn away from the abstinent man leaving the longing (behind); but his longing also turns away on seeing the Supreme.",
    "2:60": "2.60 The turbulent senses, O Arjuna, do violently carry away the mind of a wise man though he be striving (to control them).",
    "2:61": "2.61 Having restrained them all he should sit steadfast, intent on Me; his wisdom is steady whose senses are under control.",
    "2:62": "2.62 When a man thinks of the objects, attachment for them arises; from attachment desire is born; from desire anger arises.",
    "2:63": "2.63 From anger comes delusion; from delusion loss of memory; from loss of memory the destruction of discrimination; from the destruction of discrimination he perishes.",
    "2:64": "2.64 But the self-controlled man, moving among the objects with the senses under restraint and free from attraction and repulsion, attains to peace.",
    "2:65": "2.65 In that peace all pains are destroyed; for the intellect of the tranquil-minded soon becomes steady.",
    "2:66": "2.66 There is no knowledge of the Self to the unsteady and to the unsteady no meditation is possible, and to the unmeditative there can be no peace, and to the man who has no peace, how can there be happiness?",
    "2:67": "2.67 For the mind, which follows in the wake of the wandering senses, carries away his discrimination, as the wind (carries away) a boat on the waters.",
    "2:68": "2.68 Therefore, O mighty-armed Arjuna, his knowledge is steady whose senses are completely restrained from sense-objects.",
    "2:69": "2.69 That which is night to all beings, in that the self-controlled man is awake; when all beings are awake, that is night for the Muni (sage) who sees.",
    "2:70": "2.70 He attains peace into whom all desires enter as waters enter the ocean which, filled from all sides, remains unmoved; but not the man who is full of desires.",
    "2:71": "2.71 That man attains peace who, abandoning all desires, moves about without longing, without the sense of mine and without egoism.",
    "2:72": "2.72 This is the Brahmic seat (eternal state), O son of Pritha. Attaining to this, none is deluded. Being established therein, even at the end of life, one attains to oneness with Brahman.",
    "3:1": "3.1 Arjuna said  If Thou thinkest that knowledge is superior to action, O Krishna, why then, O Kesava, dost Thou ask me to engage in this terrible action?",
    "3:2": "3.2 With this apparently perplexing speech, Thou confusest, as it were, my understanding; therefore tell me that one way for certain by which I may attain bliss.",
    "3:3": "3.3 The Blessed Lord said  In this world there is a twofold path, as I said before, O sinless one; the path of knowledge of the Sankhyas and the path of action of the Yogins.",
    "3:4": "3.4 Not by non-performance of actions does man reach actionlessness; nor by mere renunciation does he attain to perfection.",
    "3:5": "3.5 Verily none can ever remain for even a moment without performing action; for everyone is made to act helplessly indeed by the alities born of Nature.",
    "3:6": "3.6 He who, restraining the organs of action, sits thinking of the sense-objects in mind, he of deluded understanding is called a hypocrite.",
    "3:7": "3.7 But whosoever, controlling the senses by the mind, O Arjuna, engages himself in Karma Yoga with the organs of action, without attachment, he excels.",
    "3:8": "3.8 Do thou perform (thy) bounden duty, for action is superior to inaction and even the maintenance of the body would not be possible for thee by inaction.",
    "3:9": "3.9 The world is bound by actions other than those performed for the sake of sacrifice; do thou, therefore, O son of Kunti (Arjuna), perform action for that sake (for sacrifice alone), free from attachment.",
    "3:10": "3.10 The Creator, having in the beginning (of creation) created mankind together with sacrifice, said, \"By this shall ye propagate; let this be the milch cow of your desires (the cow which yields all the desired objects).\"",
    "3:11": "3.11 With this do ye nourish the gods and may those gods nourish you; thus nourishing one another, ye shall attain to the highest good.",
    "3:12": "3.12 The gods, nourished by the sacrifice, will give you the desired objects. So, he who enjoys the objects given by the gods without offering (in return) to them, is verily a thief.",
    "3:13": "3.13 The righteous who eat the remnants of the sacrifice are freed from all sins; but those sinful ones who cook food (only) for their own sake verily eat sin.",
    "3:14": "3.14 From food come forth beings; from rain food is produced; from sacrifice arises rain and sacrifice is born of action.",
    "3:15": "3.15 Know thou that action comes from Brahma and Brahma comes from the Imperishable. Therefore, the all-pervading (Brahma) ever rests in sacrifice.",
    "3:16": "3.16 He who does not follow here the wheel thus set revolving, who is of sinful life, rejoicing in the senses, he lives in vain, O Arjuna.",
    "3:17": "3.17 But for that man who rejoices only in the Self, who is satisfied with the Self and who is content in the Self alone, verily there is nothing to do.",
    "3:18": "3.18 For him there is no interest whatever in what is done or what is not done; nor does he depend on any being for any object.",
    "3:19": "3.19 Therefore without attachment, do thou always perform action which should be done; for by performing action without attachment man reaches the Supreme.",
    "3:20": "3.20 Janaka and others attained perfection verily by action only; even with a view to the protection of the masses thou shouldst perform action.",
    "3:21": "3.21 Whatsoever a great man does, that the other men also do; whatever he sets up as the standard, that the world (mankind) follows.",
    "3:22": "3.22 There is nothing in the three worlds, O Arjuna, that should be done by Me, nor is there anything unattained that should be attained; yet I engage Myself in action.",
    "3:23": "3.23 For, should I not ever engage Myself in action, unwearied, men would in every way follow My path, O Arjuna.",
    "3:24": "3.24 These worlds would perish if I did not perform action; I should be the author of confusion of castes and destruction of these beings.",
    "3:25": "3.25 As the ignorant men act from attachment to action, O Bharata (Arjuna), so should the wise act without attachment, wishing the welfare of the world.",
    "3:26": "3.26 Let no wise man unsettle the mind of ignorant people who are attached to action; he should engage them in all actions, himself fulfilling them with devotion.",
    "3:27": "3.27 All actions are wrought in all cases by the alities of Nature only. He whose mind is deluded by egoism thinks, \"I am the doer.\"",
    "3:28": "3.28 But he who knows the Truth, O mighty-armed (Arjuna), about the divisions of the alities and (their) functions, knowing that the Gunas as senses move amidst the Gunas as the sense-objects, is not attached.",
    "3:29": "3.29 Those deluded by the alities of Nature are attached to the functions of the alities. The man of perfect knowledge should not unsettle the foolish one who is of imperfect knowledge.",
    "3:30": "3.30 Renouncing all actions in Me, with the mind centred in the Self, free from hope and egoism, and from (mental) fever, do thou fight.",
    "3:31": "3.31 Those men who constantly practise this teaching of Mine with faith and without cavilling, they too are freed from actions.",
    "3:32": "3.32 But those who carp at My teaching and do not practise it, deluded of all knowledge, and devoid of discrimination, know them to be doomed to destruction.",
    "3:33": "3.33 Even a wise man acts in accordance with his own nature; beings will follow Nature; what can \nrestraint do?",
    "3:34": "3.34 Attachment and aversion for the objects of the senses abide in the senses; let none come under their sway; for, they are his foes.",
    "3:35": "3.35 Better is one's own duty, though devoid of merit than the duty of another well discharged. Better is death in one's own duty; the duty of another is fraught with fear (is productive of danger).",
    "3:36": "3.36 Arjuna said  But impelled by what does man commit sin, though against his wishes, O Varshneya (Krishna), constrained as it were, by force?",
    "3:37": "3.37 The Blessed Lord said  It is desire, it is anger both of the ality of Rajas, all-devouring, all-sinful; know this as the foe here (in this world).",
    "3:38": "3.38 As fire is enveloped by smoke, as a mirror by dust, and as an embryo by the amnion, so is this enveloped by that.",
    "3:39": "3.39 O Arjuna, wisdom is enveloped by this constant enemy of the wise in the form of desire, which is unappeasable as fire.",
    "3:40": "3.40 The senses, the mind and the intellect are said to be its seat; through these it deludes the embodied by veiling his wisdom.",
    "3:41": "3.41 Therefore, O best of the Bharatas (Arjuna), controlling the senses first, do thou kill this sinful thing, the destroyer of knowledge and realisation.",
    "3:42": "3.42 They say that the senses are superior (to the body); superior to the senses is the mind; superior to the mind is the intellect; one who is superior even to the intellect is He (the Self).",
    "3:43": "3.43 Thus knowing Him Who is superior to the intellect and restraining the self by the Self, slay thou, O mighty-armed Arjuna, the enemy in the form of desire, hard to coner.",
    "4:1": "4.1 The Blessed Lord said  I taught this imperishable Yoga to Vivasvan; he told it to Manu; Manu proclaimed it to Ikshvaku.",
    "4:2": "4.2 This, handed down thus in regular succession, the royal sages knew. This Yoga, by long lapse of time, has been lost here, O Parantapa (burner of the foes).",
    "4:3": "4.3 That same ancient Yoga has been today taught to thee by Me, for thou art My devotee and My friend; it is the supreme secret.",
    "4:4": "4.4 Arjuna said  Later on was Thy birth, and prior to it was the birth of Vivasvan (the Sun); how am I to understand that Thou taughtest this Yoga in the beginning?",
    "4:5": "4.5 The Blessed Lord said  Many births of Mine have passed as well as of thine, O Arjuna; I know them all but thou knowest not, O Parantapa (scorcher of foes).",
    "4:6": "4.6 Though I am unborn, of imperishable nature, and though I am the Lord of all beings, yet, governing My own Nature, I am born by My own Maya.",
    "4:7": "4.7 Whenever there is decline of righteousness, O Arjuna, and rise of unrighteousness, then I manifest Myself.",
    "4:8": "4.8 For the protection of the good, for the destruction of the wicked and for the establishment of righteousness, I am born in every age.",
    "4:9": "4.9 He who thus know, in their true light, My divine birth and action, having abandoned the body, is not born again, he comes to Me, O Arjuna.",
    "4:10": "4.10 Freed from attachment, fear and anger, absorbed in Me, taking refuge in Me, purified by the fire of knowledge, many have attained to My Being.",
    "4:11": "4.11 In whatever way men approach Me even so do I reward them; My path do men tread in all ways, O Arjuna.",
    "4:12": "4.12 Those who long for success in action in this world sacrifice to the gods; because success is ickly attained by men through action.",
    "4:13": "4.13 The fourfold caste has been created by Me according to the differentiation of Guna and Karma; though I am the author thereof know Me as non-doer and immutable.",
    "4:14": "4.14 Actions do not taint Me, nor have I a desire for the fruit of actions. He who knows Me thus is not bound by actions.",
    "4:15": "4.15 Having known this, the ancient seekers after freedom also performed action; therefore do thou also perform action, as did the ancients in days of yore.",
    "4:16": "4.16 What is action? What is inaction? As to this even the wise are confused. Therefore I shall teach thee such action (the nature of action and inaction) by knowing which thou shalt be liberated from the evil (of Samsara, the wheel of birth and death).",
    "4:17": "4.17 For verily (the true nature) of action (enjoined by the scriptures) should be known, also (that) \nof forbidden (or unlawful) action, and of inaction; hard to understand is the nature (path) of action.",
    "4:18": "4.18 He who seeth inaction in action and action in inaction, he is wise among men; he is a Yogi and performer of all actions.",
    "4:19": "4.19 He whose undertakings are all devoid of desires and (selfish) purposes and whose actions have been burnt by the fire of knowledge,  him the wise call a sage.",
    "4:20": "4.20 Having abandoned attachment to the fruits of the action, ever content, depending on nothing, he does not do anything though engaged in activity.",
    "4:21": "4.21 Without hope and with the mind and the self controlled, having abandoned all covetousness, doing mere bodily action, he incurs no sin.",
    "4:22": "4.22 Content with what comes to him without effort, free from the pairs of opposites and envy, even-minded in success and failure, though acting, he is not bound.",
    "4:23": "4.23 To one who is devoid of attchment, who is liberated, whose mind is established in knowledge, who works for the sake of sacrifice (for the sake of God), the whole action is dissolved.",
    "4:24": "4.24 Brahman is the oblation; Brahman is the melted butter (ghee); by Brahman is the oblation poured into the fire of Brahman; Brahman verily shall be reached by him who always sees Brahman in action.",
    "4:25": "4.25 Some Yogies perform sacrifice to the gods alone; while others (who have realised the Self) offer the self as sacrifice by the Self in the fire of Brahman alone.",
    "4:26": "4.26 Some again offer the organ of hearing and other senses as sacrifice in the fire of restraint; others offer sound and other objects of the senses as sacrifice in the fire of the senses.",
    "4:27": "4.27 Others again sacrifice all the functions of the senses and those of the breath (vital energy or Prana) in the fire of the Yoga of self-restraint kindled by knowledge.",
    "4:28": "4.28 Others again offer wealth, austerity and Yoga as sacrifice, while the ascetics of self-restraint and rigid vows offer study of scriptures and knowledge as sacrifice.",
    "4:29": "4.29 Others offer as sacrifice the outgoing breath in the incoming, and the incoming in the outgoing, restraining the course of the outgoing and the incoming breaths, solely absorbed in the restraint of the breath.",
    "4:30": "4.30 Others who regulate their diet offer life-breaths in life-breaths. All these are knowers of sacrifice, whose sins are destroyed by sacrifice.",
    "4:31": "4.31 Those who eat the remnants of the sacrifice, which are like nectar, go to the eternal Brahman. This world is not for the man who does not perform sacrifice; how then can he have the other, O Arjuna?",
    "4:32": "4.32 Thus, manifold sacrifices are spread out before Brahman (literally) at the mouth or face of Brahman). Know them all as born of action and thus knowing, thou shalt be liberated.",
    "4:33": "4.33 Superior is wisdom-sacrifice to the sacrifice with objects, O Parantapa (scorcher of the foes). All actions in their entirely, O Arjuna, culminate in knowledge.",
    "4:34": "4.34 Know That by long prostration, by estion and by service; the wise who have realised the Truth will instruct thee in (that) knowledge.",
    "4:35": "4.35 Knowing ï1thatï1 thou shalt not, O Arjuna, again get deluded like this; and by that thou shalt see all beings in thy Self and also in Me.",
    "4:36": "4.36 Even if thou art the most sinful of all sinners, yet thou shalt verily cross all sins by the raft of knowledge.",
    "4:37": "4.37 As the blazing fire reduces fuel to ashes, O Arjuna, so does the fire of knowledge reduce all actions to ashes.",
    "4:38": "4.38 Verily, there is no purifier in this world like knowledge. He who is perfected in Yoga finds it in the Self in time.",
    "4:39": "4.39 The man who is full of faith, who is devoted to it, and who has subdued the senses obtains (this) knowledge; and having obtained the knowledge he attains at once to the supreme peace.",
    "4:40": "4.40 The ignorant the faithless, the doubting self goes to destruction; there is neither this world nor the other, nor happiness for the doubting.",
    "4:41": "4.41 He who has renounced actions by Yoga, whose doubts are rent asunder by knowledge, and who is self-possessed  actions do not bind him, O Arjuna.",
    "4:42": "4.42 Therefore with the sword of the knowledge (of the Self) cut asunder the doubt of the self born of ignorance, residing in thy heart, and take refuge in Yoga. Arise, O Arjuna.",
    "5:1": "5.1 Arjuna said  Renunciation of actions, O Krishna, Thou praisest, and again Yoga. Tell me conclusively that which is the better of the two.",
    "5:2": "5.2 The Blessed Lord said  Renunciation and the Yoga of action both lead to the highest bliss; but of the two, the Yoga of action is superior to the renunciation of action.",
    "5:3": "5.3 He should be known as a perpertual Sannyasi who neither hates nor desires; for, free from the pairs of opposites, O mighty-armed Arjuna, he is easily set free from bondage.",
    "5:4": "5.4 Children, not the wise, speak of knowledge and the Yoga of action or the performance of action as though they are distinct and different; he who is truly established in one obtains the fruits of both.",
    "5:5": "5.5 That place which is reached by the Sankhyas or the Jnanis is reached by the Yogis (Karma Yogis). He sees, who sees knowledge and the performance of action (Karma Yoga) as one.",
    "5:6": "5.6 But renunciation, O mighty-armed Arjuna, is hard to attain without Yoga; the Yoga-harmonised sage ickly goes to Brahman.",
    "5:7": "5.7 He who is devoted to the path of action, whose mind is ite pure, who has conered the self, who has subdued his senses and who realises his Self as the Self in all beings, though acting, is not tainted.",
    "5:8": "5.8 \"I do nothing at all,\" thus would the harmonised knower of Truth think  seeing, hearing, touching, smelling, eating, going, sleeping, breathing.",
    "5:9": "5.9 Speaking, letting go, seizing, opening and closing the eyes  convinced that the senses move among the sense-objects.",
    "5:10": "5.10 He who does actions, offering them to Brahman, and abandoning attachment, is not tainted by sin, just as a lotus-leaf is not tainted by water.",
    "5:11": "5.11 Yogis, having abandoned attachment, perform actions only by the body, mind, intellect, and even by the senses, for the purification of the self.",
    "5:12": "5.12 The united one (the well poised or the harmonised) having abandoned the fruit of action attains to the eternal peace: the non-united only (the unsteady or the unbalanced) impelled by desire, attached to the fruit, is bound.",
    "5:13": "5.13 Mentally renouncing all actions and self-controlled, the embodied one rests happily in the nine-gated city, neither acting nor causing others (body and senses) to act.",
    "5:14": "5.14 Neither agency nor actions does the Lord create for the world, nor union with the fruits of actions. But it is Nature that acts.",
    "5:15": "5.15 The Lord takes neither the demerit nor even the merit of any; knowledge is enveloped by ignorance, thery beings are deluded.",
    "5:16": "5.16 But to those whose ignorance is destroyed by the knowledge of the Self, like the sun, knowledge reveals the Supreme (Brahman).",
    "5:17": "5.17 Their intellect absorbed in That, their self being That, established in That, with That for their supreme goal, they go whence there is no return, their sins dispelled by knowledge.",
    "5:18": "5.18 Sages look with an eal eye on a Brahmana endowed with learning and humility, on a cow, on an elephant, and even on a dog and an outcaste.",
    "5:19": "5.19 Even here (in this world) birth (everything) is overcome by those whose minds rest in eality; Brahman is spotless indeed and eal; therefore they are established in Brahman.",
    "5:20": "5.20 Resting in Brahman, with steady intellect and undeluded, the knower of Brahman neither rejoiceth on obtaining what is pleasant nor grieveth on obtaining what is unpleasant.",
    "5:21": "5.21 With the self unattached to external contacts he finds happiness in the Self; with the self engaged in    the meditation of Brahman he attains to the endless happiness.",
    "5:22": "5.22 The enjoyments that are born of contacts are only generators of pain, for they have a beginning and an end, O Arjuna; the wise man does not rejoice in them.",
    "5:23": "5.23 He who is able, while still here (in this world) to withstand, before the liberation from the body, the impulse born out of desire and anger  he is a Yogi, he is a happy man.",
    "5:24": "5.24 He who is happy within, who rejoices within, and who is illuminated within, that Yogi attains absolute freedom or Moksha, himself becoming Brahman.",
    "5:25": "5.25 The sages (Rishis) obtain absolute freedom or Moksha  they whose sins have been destroyed, whose dualities (perception of dualities or experience of the pairs of opposites) are torn asunder, who are self-controlled, and intent on the welfare of all beings.",
    "5:26": "5.26 Absolute freedom (or Brahmic bliss) exists on all sides for those self-controlled ascetics who are free from desire and anger, who have controlled their thoughts and who have realised the Self.",
    "5:27": "5.27 Shutting out (all) external contacts and fixing the gaze between the eyrow, ealising the outgoing and incoming breaths moving within the nostrils.",
    "5:28": "5.28 With the senses, the mind and the intellect (ever) controlled, having liberation as his supreme goal, free from desire, fear and anger  the sage is verily liberated for ever.",
    "5:29": "5.29 He who knows Me as the enjoyer of sacrifices and austerities, the great Lord of all the worlds and the friend of all beings, attains to peace.",
    "6:1": "6.1 The Blessed Lord said  He who performs his bounden duty without depending on the fruits of his actions  he is a Sannyasi and a Yogi; not he who is without fire and without action.",
    "6:2": "6.2 Do thou, O Arjuna, know Yoga to be that which they call renunciation; no one verily becomes a Yogi who has not renounced thoughts.",
    "6:3": "6.3 For a sage who wishes to attain to Yoga, action is said to be the means; for the same sage who has attained to Yoga, inaction (iescence) is said to be the means.",
    "6:4": "6.4 When a man is not attached to the sense-objects or to actions, having renounced all thoughts, then he is said to have attained to Yoga.",
    "6:5": "6.5 One should raise oneself by one's Self alone; let not one lower oneself; for the Self alone is the friend of oneself, and the Self alone is the enemy of oneself.",
    "6:6": "6.6 The Self is the friend of the self of him by whom the self has been conered by the Self, but to the unconered self, this Self stands in the position of an enemy, like an (external) foe.",
    "6:7": "6.7 The Supreme Self of him who is self-controlled and peaceful is balanced in cold and heat, pleasure and pain, as also in honour and dishonour.",
    "6:8": "6.8 The Yogi who is satisfied with the knowledge and the wisdom (of the Self), who has conered the senses, and to whom a clod of earth, a piece of stone and gold are the same, is said to be harmonied (i.e., is said to have attained Nirvikalpa Samadhi).",
    "6:9": "6.9 He who is of the same mind to the good-hearted, friends, enemies, the indifferent, the neutral, the hateful, the relatives, the righteous and the unrighteous, excels.",
    "6:10": "6.10 Let the Yogi try constantly to keep the mind steady, remaining in solitude, alone, with the mind and the body controlled, and free from hope and covetousness.",
    "6:11": "6.11 In a clean spot, having established a firm seat of his own, neither too high nor too low, made of a cloth, a skin and Kusa-grass, one over the other.",
    "6:12": "6.12 There, having made the mind one-pointed, with the actions of the mind and the senses controlled, let him, seated on the seat, practise Yoga for the purification of the self.",
    "6:13": "6.13 Let him firmly hold his body, head and neck erect and still, gazing at the tip of his nose, without looking around.",
    "6:14": "6.14 Serene-minded, fearless, firm in the vow of a Brahmachari, having controlled the mind, thinking of Me and balanced in mind, let him sit, having Me as his supreme goal.",
    "6:15": "6.15 Thus always keeping the mind balanced, the Yogi, with the mind controlled, attains to the peace abiding in Me, which culminates in liberation.",
    "6:16": "6.16 Verily Yoga is not possible for him who eats too much, nor for him who does not eat at all, nor for him who sleeps too much, nor for him who is (always) awake, O Arjuna.",
    "6:17": "6.17 Yoga becomes the destroyer of pain for him who is moderate in eating and recreation (such \nas walking, etc.), who is moderate in exertion in actions, who is moderate in sleep and wakefulness.",
    "6:18": "6.18 When the perfectly controlled mind rests in the Self only, free from longing for all the objects of desires, then it is said, 'He is united'.",
    "6:19": "6.19 As a lamp placed in a windless spot does not flicker  to such is compared the Yogi of controlled mind, practising Yoga in the Self (or absorbed in the Yoga of the Self).",
    "6:20": "6.20 When the mind, restrained by the practice of Yoga attains to quietude and when seeing the Self by the self, he is satisfied in his own Self.",
    "6:21": "6.21 When he (the Yogi) feels that Infinite Bliss which can be grasped by the (pure) intellect and which transcends the senses, and established wherein he never moves from the Reality.",
    "6:22": "6.22 Which, having obtained, he thinks there is no other gain superior to it; wherein estabished, he is not moved even by heavy sorrow.",
    "6:23": "6.23 Let that be known by the name of Yoga, the severance from union with pain. This Yoga should be practised with determination and with an undesponding mind.",
    "6:24": "6.24 Abandoning without reserve all desires born of Sankalpa (thought and imagination) and completely restraining the whole group of the senses by the mind from all sides.",
    "6:25": "6.25 Little by little let him attain to ietude by the intellect held firmly; having made the mind establish itself in the Self, let him not think of anything.",
    "6:26": "6.26 From whatever cause the restless and unsteady mind wanders away, from that let him restrain it and bring it under the control of the Self alone.",
    "6:27": "6.27 Supreme Bliss verily comes to this Yogi whose mind is ite peaceful, whose passion is ieted, who has become Brahman and who is free from sin.",
    "6:28": "6.28 The Yogi, always engaging the mind thus (in the practice of Yoga), freed from sins, easily enjoys the Infinite Bliss of contact with Brahman (the Eternal).",
    "6:29": "6.29 With the mind harmonised by Yoga he sees the Self abiding in all beings and all beings in the Self; he sees the same everywhere.",
    "6:30": "6.30 He who sees Me everywhere and sees everything in Me, he never becomes separated from Me, nor do I become separated from him.",
    "6:31": "6.31 He who, being established in unity, worships Me Who dwells in all beings, that Yogi abides in Me, whatever may be his mode of living.",
    "6:32": "6.32 He who, through the likeness of the Self, O Arjuna, sees eality everywhere, be it pleasure or pain, he is regarded as the highest Yogi.",
    "6:33": "6.33 Arjuna said  This Yoga of eanimity taught by Thee, O Krishna, I do not see its steady continuance, because of the restlessness (of the mind).",
    "6:34": "6.34 The mind verily is restless, turbulent, strong and unyielding, O Krishna: I deem it as difficult to control it as to control the wind.",
    "6:35": "6.35 The Blessed Lord said  Undoubtedly, O mighty-armed Arjuna, the mind is difficult to control and restless; but by practice and by dispassion it may be restrained.",
    "6:36": "6.36 I think Yoga is hard to be attained by one of uncontrolled self, but the self-controlled and striving one can attain to it by the (proper) means.",
    "6:37": "6.37 Arjuna said  He who is unable to control himself though he has the faith, and whose mind wanders away from Yoga, what end does he, having failed to attain perfection in Yoga, mee,t O Krishna?",
    "6:38": "6.38 Fallen from both, does he not perish like a rent cloud, supportless, O mighty-armed (Krishna), deluded on the path of Brahman?",
    "6:39": "6.39 This doubt of mine, O Krishna, do Thou dispel completely; because it is not possible for any but Thee to dispel this doubt.",
    "6:40": "6.40 The Blessed Lord said  O Arjuna, neither in this world, nor in the next world is there destruction for him; none, verily, who does good, O My son, ever comes to grief.",
    "6:41": "6.41 Having attained to the worlds of the righteous and having dwelt there for everlasting years, he who fell from Yoga is rorn in a house of the pure and wealthy.",
    "6:42": "6.42 Or he is born in a family of even the wise Yogis; verily a birth like this is very difficult to obtain in this world.",
    "6:43": "6.43 Thee he comes in touch with the knowledge acired in his former body and strives more than before for perfection, O Arjuna.",
    "6:44": "6.44 By that very former practice he is borne on in spite of himself. Even he who merely wishes to know Yoga goes beyond the Brahmic word.",
    "6:45": "6.45 But the Yogi who strives with assiduity, purified of sins and perfected gradually through many births, reaches the highest goal.",
    "6:46": "6.46 The Yogi is thought to be superior to the ascetics and even superior to men of knowledge (obtained through the study of scriptures); he is also superior to men of action; therefore be thou a Yogi, O Arjuna.",
    "6:47": "6.47 And among all the Yogis he who, full of faith and with his inner self merged in Me, worships Me is deemed by Me to be the most devout.",
    "7:1": "7.1 The Blessed Lord said  O Arjuna, hear how you shall without doubt know Me fully, with the mind intent on Me, practising Yoga and taking refuge in Me.",
    "7:2": "7.2 I shall declare to thee in full this knowledge combined with realisation, after knowing which nothing more here remains to be known.",
    "7:3": "7.3 Among thousands of men, one perchance strives for perfection; even among those successful strivers, only one perchance knows Me in essence.",
    "7:4": "7.4 Earth, water, fire, air, ether, mind, intellect and egoism  thus is My Nature divided eightfold.",
    "7:5": "7.5 This is the inferior Prakriti, O mighty-armed (Arjuna); know thou as different from it My higher Prakriti (Nature), the very life-element, by which this world is upheld.",
    "7:6": "7.6 Know that these two (Natures) are the womb of all beings. So I am the source and dissolution of the whole universe.",
    "7:7": "7.7 There is nothing whatsoever higher than Me, O Arjuna. All this is strung on Me, as clusters of gems on a string.",
    "7:8": "7.8 I am the sapidity in water, O Arjuna; I am the light in the moon and the sun; I am the syllable Om in all the Vedas, sound in ether and virility in men.",
    "7:9": "7.9 I am the sweet fragrance in the earth and the brilliance in the fire, the life in all beings, and I am the austerity in ascetics.",
    "7:10": "7.10 Know Me, O Arjuna, as the eternal seed of all beings; I am the intelligence of the intelligent; the splendour of the splendid objects am I.",
    "7:11": "7.11 Of the strong, I am the strength devoid of desire and attachment, and in (all) beings, I am the desire unopposed to Dharma, O Arjuna.",
    "7:12": "7.12 Whatever beings (and objects) that are pure, active and inert, know that they proceed from Me. They are in Me, yet I am not in them.",
    "7:13": "7.13 Deluded by these Natures (states or things) composed of the three alities of Nature all this world does not know Me as distinct from them and immutable.",
    "7:14": "7.14 Verily, this divine illusion of Mine, made up of the (three) alities (of Nature) is difficult to cross over; those who take refuge in Me alone, cross over this illusion.",
    "7:15": "7.15 The evil-doers and the deluded who are the lowest of men do not seek Me; they whose knowledge is destroyed by illusion follow the ways of demons.",
    "7:16": "7.16 Four kinds of virtuous men worship Me, O Arjuna, and they are the distressed, the seekr of knowledge, the seekr of wealth and the wise, O lord of the Bharatas.",
    "7:17": "7.17 Of them the wise, ever steadfast and devoted to the One, excels (is the best); for I am exceedingly dear to the wise and he is dear to Me.",
    "7:18": "7.18 Noble indeed are all these; but I deem the wise man as My very Self; for, steadfast in mind he is established in Me alone as the supreme goal.",
    "7:19": "7.19 At the end of many births the wise man comes to Me, realising that all this is Vaasudeva (the innermost Self); such a great soul (Mahatma) is very hard to find.",
    "7:20": "7.20 Those whose wisdom has been rent away by this or that desire, go to other gods, following this or that rite, led by their own nature.",
    "7:21": "7.21 Whatsoever form any devotee desires to worship with faith  that (same) faith of his I make firm and unflinching.",
    "7:22": "7.22 Endowed with that faith, he engages in the worship of that (form) and from it he obtains his desire, these being verily ordained by Me (alone).",
    "7:23": "7.23 Verily the reward (fruit) that accrues to those men of small intelligence is finite. The worshippers of the gods go to them, but My devotees come to Me.",
    "7:24": "7.24 The foolish think of Me, the Unmanifest, as having manifestation, knowing not My higher, immutable and most excellent nature.",
    "7:25": "7.25 I am not manifest to all (as I am) veiled by the Yoga-Maya. This deluded world does not know Me, the unborn and imperishable.",
    "7:26": "7.26 I know, O Arjuna, the beings of the past, the present and the future, but no one knows Me.",
    "7:27": "7.27 By the delusion of the pairs of opposites arising from desire and aversion, O Bharata, all beings are subject to delusion at birth, O Parantapa.",
    "7:28": "7.28 But those men of virtuous deeds whose sins have come to an end, and who are freed from the delusion of the pairs of opposites, worship Me, steadfast in their vows.",
    "7:29": "7.29 Those who strive for liberation from old age and death, taking refuge in Me, realise in full ï1thatï1 Brahman, the whole knowledge of the Self and all action.",
    "7:30": "7.30 Those who know Me with the Adhibhuta (pertaining to the elements), Adhidaiva (pertaining to the gods) and the Adhiyajna (pertaining to the sacrifice) know Me even at the time of death, steadfast in mind.",
    "8:1": "8.1 Arjuna said  What is that Brahman? What is Adhyatma? What is action, O best among men? What is declared to be Adhibhuta? And, what is Adhidaiva said to be?",
    "8:2": "8.2 Who and how is Adhiyajna here in this body, O destroyer of Madhu (Krishna)? And how at the time of death, art Thou to be known by the self-controlled?",
    "8:3": "8.3 The Blessed Lord said  Brahman is the Imperishable, the Supreme; Its essential nature is called Self-knowledge; the offering (to the gods) which causes existence and manifestation of beings and which also sustains them is called action.",
    "8:4": "8.4 Adhibhuta (knowledge of the elements) pertains to My perishable Nature and the Purusha or the Soul is the Adhidaiva; I alone am the Adhiyajna here in this body, O best among the embodied (men).",
    "8:5": "8.5 And whosoever, leaving the body, goes forth remembering Me alone, at the time of death, he attains My Being: there is no doubt about this.",
    "8:6": "8.6 Whosoever at the end leaves the body, thinking of any being, to that being only does he go, O son of Kunti (Arjuna), because of his constant thought of that being.",
    "8:7": "8.7 Therefore at all times remember Me only and fight. With mind and intellect fixed (or absorbed) in Me, thou shalt doubtessly come to Me alone.",
    "8:8": "8.8 With the mind not moving towards any other thing, made steadfast by the method of habitual meditation, and constantly meditating, one goes to the Supreme Person, the Resplendent, O Arjuna.",
    "8:9": "8.9 Whosoever meditates on the Omniscient, the Ancient, the Ruler (of the whole world), minuter than an atom, the supporter of all, of inconceivable form, effulgent like the sun and beyond the darkness of ignorance.",
    "8:10": "8.10 At the time of death, with unshaken mind, endowed with devotio, by the power of Yoga, fixing the whole life-breath in the middle of the two eyrows, he reaches that resplendent Supreme Person.",
    "8:11": "8.11 That which is declared Imperishable by those who know the Vedas, that which the self-controlled (ascetics or Sannyasins) and passion-free enter, that desiring which celibacy is practised  that goal I will declare to thee in brief.",
    "8:12": "8.12 Having closed all the gates, confined the mind in the heart and fixed the life-breath in the head, engaged in the practice of concentration.",
    "8:13": "8.13 Uttering the one-syllabled Om  the Brahman  and remembering Me, he who departs, leaving the body, attains to the Supreme Goal.",
    "8:14": "8.14 I am easily attainable by that ever-steadfast Yogi who constantly and daily remembers Me (for a long time), not thinking of anything else (with a single mind or one-pointed mind), O Partha (Arjuna).",
    "8:15": "8.15 Having attained Me these great souls do not again take birth (here) which is the place of pain \nand is non-eternal: they have reached the highest perfection (liberation).",
    "8:16": "8.16 (All) the worlds including the world of Brahma are subject to return again, O Arjuna; but he who reaches Me, O son of Kunti, has no rirth.",
    "8:17": "8.17 Those people who know the day of Brahma which is of a duration of a thousand Yugas (ages) and the night which is also of a thousand Yugas duration, they know day and night.",
    "8:18": "8.18 From the Unmanifested all the manifested (worlds) proceed at the coming of the 'day'; at the coming of the 'night' they dissolve verily into ï1thatï1 alone which is called the Unmanifested.",
    "8:19": "8.19 This same multitude of beings, being born again and again, is dissolved, helplessly, O Arjuna (into the Unmanifested) at the coming of the night and comes forth at the coming of the day.",
    "8:20": "8.20 But verily there exists, higher than this Unmanifested, another unmanifested Eternal, which is not destroyed when all beings are destroyed.",
    "8:21": "8.21 What is called the Unmanifested and the Imperishable, That they say is the highest goal. They who reach It do not return (to this Samsara). That is My highest abode (place or state).",
    "8:22": "8.22 That highest Purusha, O Arjuna, is attainable by unswerving devotion to Him alone within Whom all beings dwell and by Whom all this is pervaded.",
    "8:23": "8.23 Now I will tell thee, O chief of Bharatas, the times departing at which the Yogis will return or not return.",
    "8:24": "8.24 Fire, light daytime, the bright fortnight, the six months of the northern path of the sun (the northern solstice)  departing then (by these) men who know Brahman go to Brahman.",
    "8:25": "8.25 Attaining to the lunar light by smoke, night time, the dark fortnight also, the six months of the southern path of the sun (the southern solstice), the Yogi returns.",
    "8:26": "8.26 The bright and the dark paths of the world are verily thought to be eternal; by the one (the bright path) a man goes not to return and by the other (the dark path) he returns.",
    "8:27": "8.27 Knowing these paths, O Arjuna, no Yogi is deluded; therefore at all times be steadfast in Yoga.",
    "8:28": "8.28 Whatever fruit of merit is declared (in the scriptures) to accrue from (the study of) the Vedas, (the performance of) sacrifices, (the practice of) austerities, and gifts  beyond all this goes the Yogi, having known this; and he attains to the Supreme Primeval (first or ancient) Abode.",
    "9:1": "9.1 The Blessed Lord said  I shall now declare to thee who does not cavil, the greatest secret, the knowledge combined with experience (Self-realisation). Having known this thou shalt be free evil.",
    "9:2": "9.2 This is the kingl science, the kingly secret, the supreme purifier, realisable by direct intuitional knowledge, according to righteousness, very easy to perform and imperishable.",
    "9:3": "9.3 Those who have no faith in this Dharma (knowledge of the Self), O Parantapa (Arjuna), return to the path of this world of death without attaining Me.",
    "9:4": "9.4 All this world is pervaded by Me in My unmanifest aspect; all beings exist in Me, but I do not dwell in them.",
    "9:5": "9.5 Nor do beings exist in Me (in reality); behold My divine Yoga, supporting all beings, but not dwelling in them, is My Self, the efficient cause of beings.",
    "9:6": "9.6 As the mighty wind, moving everywhere, rests always in the ether, even so, know thou that all beings rest in Me.",
    "9:7": "9.7 All beings, O Arjuna, go into My Nature at the end of a Kalpa; I send them forth again at the beginning of (the next) Kalpa.",
    "9:8": "9.8 Animating My Nature, I again and again send forth all this multitude of beings, helpless by the force of the Nature.",
    "9:9": "9.9 These acts do not bind Me, O Arjuna, sitting like one indifferent, unattached to those acts.",
    "9:10": "9.10 Under Me as supervisor, Nature produces the moving and the unmoving; because of this, O Arjuna, the world revolves.",
    "9:11": "9.11 Fools disregard Me, clad in human form, not knowing My higher Being as the great Lord of (all) beings.",
    "9:12": "9.12 Of vain hopes, of vain actions, of vain knowledge and senseless, they verily are possessed of the deceitful nature of demons and undivine beings.",
    "9:13": "9.13 But the great souls, O Arjuna, partaking of My divine nature, worship Me with a single mind (with the mind devoted to nothing else), knowing Me as the imperishable source of beings.",
    "9:14": "9.14 Always glorifying Me, striving,firm in vows, prostrating themselves before Me, they worship Me with devotion always steadfast.",
    "9:15": "9.15 Others also sacrificing with the wisdom-sacrifice worship Me, the All-faced, as one, as distinct, and as manifold.",
    "9:16": "9.16 I am the Kratu; I am the Yajna; I am the offering (food) to the manes; I am the medicinal herbs and all the plants; I am the Mantra; I am also the Ghee or the melted butter; I am the fire; I am the oblation.",
    "9:17": "9.17 I am the father of this world, the mother, the dispenser of the fruits of actions and the \ngrandfather; the (one) thing to be known, the purifier, the sacred monosyllable (Om), and also the Rik-, the Sama-and the Yajur-Vedas.",
    "9:18": "9.18 I am the goal, the supporter, the Lord, the witness, the abode, the shelter, the friend, the origin, the dissolution, the foundation, the treasure-house and the seed which is imperishable.",
    "9:19": "9.19 (As the sun) I give heat; I withhold and send forth the rain; I am immortality and also death, existence and non-existence, O Arjuna.",
    "9:20": "9.20 The knowers of the three Vedas, the drinkers of Soma, purified of all sins, worshipping Me by sacrifices, pray for the way to heaven; they reach the holy world of the Lord of the gods and enjoy in heavn the divine pleasures of the gods.",
    "9:21": "9.21 They, having enjoyed the vast heaven, enter the world of mortals when their merit is exhausted; thus abiding by the injunctions of the ï1threeï1 (Vedas) and desiring (objects of) desires, they attain to the state of going and returning.",
    "9:22": "9.22 For those men who worship Me alone, thinking of no other, for those ever-united, I secure what is not already possessed and preserve what they already possess.",
    "9:23": "9.23 Even those devotees who, endowed with faith, worship other gods, worship Me alone, O Arjuna, b the wrong method.",
    "9:24": "9.24 (For) I alone am the enjoyer and also the Lord of all sacrifices; but they do not know Me in essence (in reality), and hence they fall (return to this mortal world).",
    "9:25": "9.25 The worshippers of the gods go to them; to the manes go the ancestor-worshippers; to the deities who preside over the elements go their worshippers; but My devotees come to Me.",
    "9:26": "9.26 Whoever offers Me with devotion a leaf, a flower, a fruit or a little water  that, so offered devotedly by the pure-minded, I accept.",
    "9:27": "9.27 Whatever thou doest, whatever thou eatest, whatever thou offerest in sacrifice, whatever thou givest, whatever thou practisest as austerity, O Arjuna, do it as an offering unto Me.",
    "9:28": "9.28 Thus shalt thou be freed from the bonds of actions yielding good and evil fruits; with the mind steadfast in the Yoga of renunciation, and liberated, thou shalt come unto Me.",
    "9:29": "9.29 The same am I to all beings; to Me there is none hateful or dear; but those who worship Me with devotion are in Me and I am also in them.",
    "9:30": "9.30 Even if the most sinful worships Me, with devotion to none else, he too should indeed by regarded as righteous for he has rightly resolved.",
    "9:31": "9.31 Soon he becomes righteous and attains to eternal peace; O Arjuna, proclaim thou for certain that My devotee never perishes.",
    "9:32": "9.32 For, taking refuge in Me, they also who, O Arjuna, may be of a sinful birth  women, Vaisyas as well as Sudras  attain the Supreme Goal.",
    "9:33": "9.33 How much more (easily) then the hold Brahmins and devoted royal saints (attain the goal); having come to this impermanent and unhappy world, do thou worship Me.",
    "9:34": "9.34 Fix thy mind on Me; by devoted to Me; sacrifice unto Me; bow down to Me; having thus united thy whole self to Me, taking Me as the supreme goal, thou shalt come unto Me.",
    "10:1": "10.1 The Blessed Lord said  Again, O mighty-armed Arjuna, listen to my supreme word which I will declare to thee who who art beloved, for thy welfare.",
    "10:2": "10.2 Neither the hosts of the gods nor the great sages know My origin; for in every way I am the source of all the gods and the great sages.",
    "10:3": "10.3 He who knows Me as unborn and beginningless, as the great Lord of the worlds, he, among mortals, is undeluded and he is liberated from all sins.",
    "10:4": "10.4 Intellect, wisdom, non-delusion, forgiveness, truth, self-restraint, calmness, happiness, pain, existence or birth, non-existence or death, fear and also fearlessness.",
    "10:5": "10.5 Non-injury, eanimity, contentment, austerity, beneficence, fame, ill-fame  (these) different kinds of alities of beings arise from Me alone.",
    "10:6": "10.6 The seven great sages, the ancient four and also the Manus, possessed of powers like Me (on account of their minds being fixed on Me), were born of (My) mind; from them are these creatures born in this world.",
    "10:7": "10.7 He who in truth knows these manifold manifestations of My Being and (this) Yoga-power of Mine becomes established in the unshakable Yoga; there is no doubt about it.",
    "10:8": "10.8 I am the source of all; from Me everything evolves; understanding thus, the wise, endowed with meditation, worship Me.",
    "10:9": "10.9 With their mind and their life wholly absorbed in Me, enlightening each other and ever speaking of Me, they are satisfied and delighted.",
    "10:10": "10.10 To them who are ever steadfast, worshipping Me with love, I give the Yoga of discrimination by which they come to Me.",
    "10:11": "10.11 Out of mere compassion for them, I, dwelling within their Self, destroy the darkness born of ignorance by the luminous lamp of knowledge.",
    "10:12": "10.12 Arjuna said  Thou art the Supreme Brahman, the supreme abode (or the supreme light), the supreme purifier, eternal, divine Person, the primeval God, unborn andn omnipresent.",
    "10:13": "10.13 All the sages have thus declared Thee, as also the divine sage Narada; so also Asita, Devala and Vyasa; and now Thou Thyself sayest so to me.",
    "10:14": "10.14 I believe all this that Thou sayest to me to be true, O Krishna; verily, O blessed Lord! neither the gods nor the demons know Thy manifestation (origin).",
    "10:15": "10.15 Verily, Thou Thyself knowest Thyself by Thyself, O Supreme Person, O source and Lord of beings, O God of gods, O ruler of the world!",
    "10:16": "10.16 Thou shouldst indeed tell, without reserve, of Thy divine glories by which Thou existest, pervading all these worlds. (None else can do so.)",
    "10:17": "10.17 How shall I, ever meditating, know Thee, O Yogin? In what aspects or things, O blessed \nLord, art Thou to be thought of by me?",
    "10:18": "10.18 Tell me again in detail, O Krishna, of Thy Yogic power and glory; for I am not satiated with what I have heard of Thy life-giving and nectar-like speech.",
    "10:19": "10.19 The Blessed Lord said  Very well! Now I will declare to thee My divine glories in their prominence, O Arjuna; there is no end to their detailed description.",
    "10:20": "10.20 I am the Self, O Gudakesa, seated in the hearts of all beings; I am the beginning, the middle and also the end of all beings.",
    "10:21": "10.21 Among the (twelve) Adityas, I am Vishnu; among luminaries, the radiant sun; I am Marichi among the (seven or forty-nine) Maruts; among stars the moon am I.",
    "10:22": "10.22 Among the Vedas I am the Sama-Veda; I am Vasava among the gods; among the senses I am the mind; and I am intelligence among living beings.",
    "10:23": "10.23 And, among the Rudras I am Sankara; among the Yakshas and Rakshasas, the Lord of wealth (Kubera); among the Vasus I am Pavaka (fire); and among the (seven) mountains I am the Meru.",
    "10:24": "10.24 And, among the household priests (of kings), O Arjuna, know Me to be the chief, Brihaspati; among the army generals I am Skana; among lakes I am the ocean.\n'",
    "10:25": "10.25 Among the great sages I am Bhrigu; among words I am the one syllable (Om); among sacrifices I am the sacrifice of silent repetition; among the immovable things I am the Himalayas.",
    "10:26": "10.26 Among all the trees ( I am) the Peepul; among the divine sages, I am Narada; among Gandharvas, Chitraratha; among the perfected, the sage Kapila.",
    "10:27": "10.27 Know Me as Ucchaisravas born of nectar, among horses; among lordly elephants (I am) the Airavata; and, among men, the king.",
    "10:28": "10.28 Among weapons I am the thunderbolt; among cows I am the wish-fulfilling cow called Kamadhenu; I am the progenitor, the god of love; among serpents I am Vasuki.",
    "10:29": "10.29 I am Ananta among the Nagas; I am Varuna among water-deities; Aryaman among the Manes I am; I am Yama among the governors.",
    "10:30": "10.30 And, I am Prahlada among the demons, among the reckoners I am time; among beasts I am the lion, and Vainateya (Garuda) among birds.",
    "10:31": "10.31 Among the purifiers (or the speeders) I am the wind; Rama among the warriors am I; among the fishes I am the shark; among the streams I am the Ganga.",
    "10:32": "10.32 Among creations I am the beginning, the middle and also the end, O Arjuna; among the sciences I am the science of the Self; and I am the logic among controversialists.",
    "10:33": "10.33 Among the letters of the alphabets, the letter 'A' I am and the dual among the compounds. I am verily the inexhaustible or everlasting time; I am the dispenser (of the fruits of actions) having \nfaces in all directions.",
    "10:34": "10.34 And I am the all-devouring Death, and the prosperity of those who are to be prosperous; among the feminine alities (I am) fame, prosperity, speech, memory, intelligence, firmness and forgiveness.",
    "10:35": "10.35 Among the hymns also I am the Brihatsaman; among metres Gayatri am I; among the montsh I am the Margasirsha; among the seasons (I am) the flowery season.",
    "10:36": "10.36 I am the gambling of the fraudulent; I am the splendour of the splendid; I am victory; I am determination (of those who are determined); I am the goodness of the good.",
    "10:37": "10.37 Among the Vrishnis I am Vaasudeva; among the Pandavas I am Arjuna; among the sages I am Vyasa; among the Poets I am Usanas, the poet.",
    "10:38": "10.38 Of those who punish, I am the sceptre; among those who seek victory, I am statesmanship; and also among secrets, I am silence; knowledge among knowers I am.",
    "10:39": "10.39 And whatever is the seed of all beings, that also am I, O Arjuna; there is no being, whether moving or unmoving, that can exist without Me.",
    "10:40": "10.40 There is no end to My divine gloreis, O Arjuna, but this is a brief statement by Me of the particulars of My divine glories.",
    "10:41": "10.41 Whatever being there is glorious, prosperous or powerful, that know thou to be a manifestation of a part of My splendour.",
    "10:42": "10.42 But, of what avail to thee is the knowledge of all these details, O Arjuna? I exist, supporting this whole world by one part of Myself.",
    "11:1": "11.1 Arjuna said  By this word (explanation) of the highest secret concerning the Self which Thou hast spoken, for the sake of blessing me, my delusion is gone.",
    "11:2": "11.2 The origin and the destruction of beings verily have been heard by me in detail from Thee, O lotus-eyed Lord, and also Thy inexhaustible greatness.",
    "11:3": "11.3 (Now) O Supreme Lord, as Thou hast thus described Thyself, O Supreme Person, I wish to see Thy divine form.",
    "11:4": "11.4 If Thou, O Lord, thinkest it possible for me to see it, do Thou, then, O Lord of the Yogins, show me Thy imperishable Self.",
    "11:5": "11.5 The Blessed Lord said  Behold, O Arjuna, forms of Mine, by the hundreds and thousands, of different sorts, divine, and of various colours and shapes.",
    "11:6": "11.6 Behold the Adityas, the Vasus, the Rudras, the two Asvins and also the Maruts; behold many wonders never seen before, O Arjuna.",
    "11:7": "11.7 Now behold, O Arjuna, in this, My body, the whole universe centred in one  including the moving and the unmoving  and whatever else thou desirest to see.",
    "11:8": "11.8 But thou art not able to behold Me with these thine own eyes; I give thee the divine eye; behold My lordly Yoga.",
    "11:9": "11.9 Sanjaya said  Having thus spoken, O king, the great Lord of Yoga, hari (Krishna), showed to Arjuna His supreme form as the Lord.",
    "11:10": "11.10 With numerous mouths and eyes, with numerous wonderful sights, with numerous divine ornaments, with numerous divine weapons uplifted (such a form He showed).",
    "11:11": "11.11 Wearing divine garlands (necklaces) and apparel, anointed with divine unguents, the all-wonderful, resplendent (Being) endless with faces on all sides.",
    "11:12": "11.12 If the splendour of a thousand suns were to blaze out at once (simultaneously) in the sky, that would be the splendour of that mighty Being (great Soul).",
    "11:13": "11.13 There, in the body of the God of gods, Arjuna then saw the whole universe resting in one, with its many groups.",
    "11:14": "11.14 Then, Arjuna, filled with wonder and with his hair standing on end, bowed down his head to the God and spoke with joined palms.",
    "11:15": "11.15 Arjuna said  I see all the gods, O God, in Thy body, and (also) hosts of various classes of beings, Brahma, the Lord, seated on the lotus, all the sages and the celestial serpents.",
    "11:16": "11.16 I see Thee of boundless form on every side with many arms, stomachs, mouths and eyes: neither the end nor the middle nor also the beginning do I see, O Lord of the universe, O Cosmic Form.",
    "11:17": "11.17 I see Thee with the diadem, the club and the discus, a mass of radiance shining \neverywhere, very hard to look at, blazing all round like burning fire and the sun, and immeasurable.",
    "11:18": "11.18 Thou art the Imperishable, the Supreme Being, worthy to be known. Thou art the great treasure-house of this universe; Thou art the imperishable protector of the eternal Dhrama; Thou art the Primal Person, I deem.",
    "11:19": "11.19 I see Thee without beginning, middle or end, infinite in power, of endless arms, the sun and the moon being Thy eyes, the burning fire Thy mouth, heating the whole universe with Thy radiance.",
    "11:20": "11.20 This space between the earth and the heaven and all the arters are filled by Thee alone; having seen this, Thy wonderful and teriible form, the three worlds are trembling with fear, O great-souled Being.",
    "11:21": "11.21 Verily, into Thee enter these hosts of gods; some extol Thee in fear with joined palms; saying 'may it be well', bands of great sages and perfected ones praise Thee with hymns complete.",
    "11:22": "11.22 The Rudras, Adityas, Vasus, Sadhyas, Visvedevas, the two Asvins, Maruts, the manes and the hosts of celestial singers, Yakshas, demons and the perfected ones, are all looking at Thee, in great amazement.",
    "11:23": "11.23 Having seen Thy immeasurable form with many mouths and eyes, O mighty-armed, with many arms, thighs and feet, with many stomachs and fearful with many teeth  the worlds are terrified and so am I.",
    "11:24": "11.24 On seeing Thee (the Cosmic Form) touching the sky, shining in many colours, with mouths wide open, with large fiery eyes, I am terrified at heart and find neither courage nor peace, O Vishnu.",
    "11:25": "11.25 Having seen Thy mouths fearful with teeth (blazing) like the fires of cosmic dissolution, I know not the four arters, nor do I find peace. Have mercy, O Lord of the gods, O abode of the universe.",
    "11:26": "11.26 All the sons of Dhritarashtra, with the hosts of kings of the earth, Bhishma, Drona and Karna, with the chief among our warriors.",
    "11:27": "11.27 Some hurriedly enter Thy mouths with their terrible teeth, fearful to behold. Some are found sticking in the gaps between the teeth with their heads crushed to powder.",
    "11:28": "11.28 Verily, just as many torrents of rivers flow towards the ocean, even so these heroes in the world of men enter Thy flaming mouths.",
    "11:29": "11.29 As moths hurriedly rush into a blazing fire for (their own) destruction, so also these creatures hurriedly rush into Thy mouths for (their own) destruction.",
    "11:30": "11.30 Thou lickest up, devouring all the worlds on every side with Thy flaming mouths. Thy fierce rays, filling the whole world with radiance, are burning, O Vishnu!",
    "11:31": "11.31 Tell me, who Thou art, so fierce of form. Salutations to Thee, O God Supreme: have mercy. I desire to know Thee, the original Being. I know not indeed Thy working.",
    "11:32": "11.32 The Blessed Lord said  I am the full-grown world-destroying Time, now engaged in destroying the worlds. Even without thee, none of the warriors arrayed in the hostile armies shall live.",
    "11:33": "11.33 Therefore, stand up and obtain fame. Coner the enemies and enjoy the unrivalled kingdom. Verily by Me have they been already slain; be thou a mere instrument, O Arjuna.",
    "11:34": "11.34 Drona, Bhishma, Jayadratha, Karna and other brave warriors  these are already slain by Me: do thou kill; be not distressed with fear; fight and thou shalt coner thy enemies in battle.",
    "11:35": "11.35 Sanjaya said  Having heard that speech of Lord Krishna, Arjuna, with joined palms, trembling, prostrating himself, again addressed Krishna, in a choked voice, bowing down, overwhelmed with fear.",
    "11:36": "11.36 Arjuna said  It is meet, O Krishna, that the world delights and rejoices in Thy praise; demons fly in fear to all arters and the hosts of the perfected ones bow to Thee.",
    "11:37": "11.37 And why should they not, O great Soul, bow to Thee Who art greater (than all else), the primal cause even of the Creator (Brahma), O Infinite Being, O Lord of the gods, O Abode of the universe; Thou art the imperishable, the Being, the non-being and That which is the supreme (that which is beyond the Being and the non-being).",
    "11:38": "11.38 Thou art the primal God, the ancient Purusha, the supreme refuge of this universe, the knower, the knowable and the supreme Abode. By Thee is the universe pervaded, O Being of infinite forms.",
    "11:39": "11.39 Thou art Vayu, Yama, Agni, Varuna, the moon, the Creator, and the great-grandfather. Salutations, salutations unto Thee, a thousand times, and again salutations, salutations unto Thee.",
    "11:40": "11.40 Salutations to Thee, in front and behind! Salutations to Thee on every side! O All!! Thou infinite in power and prowess, pervadest all; wherefore Thou art all.",
    "11:41": "11.41 Whatever I have presumptuously said from carelessness or love, addressing Thee as O Krishna! O Yadava! O Friend! regarding Thee merely as a friend, unknowing of this, Thy greatness.",
    "11:42": "11.42 In whatever way I may have insulted Thee for the sake of fun, while at play, reposing, sitting or at meals, when alone (with Thee), O Krishna, or in company  that I implore Thee, immeasurable one, to forgive.",
    "11:43": "11.43 Thou art the Father of this world, moving and unmoving. Thou art to be adored by this world, Thou, the greatest Guru; (for) none there exists who is eal to Thee; how then could there be another superior to Thee in the three worlds, O Being of unealled power?",
    "11:44": "11.44 Therefore, bowing down, prostrating my body, I crave Thy forgiveness, O adorable Lord. As a father forgives his son, a friend his (dear) friend, a lover his beloved, even so shouldst Thou \nforgive me, O God.",
    "11:45": "11.45 I am delighted, having seen what has never been seen before; and yet my mind is distressed with fear. Show me that (previous) form only, O God; have mercy, O God of gods, O Abode of the universe.",
    "11:46": "11.46 I desire to see Thee as before, crowned, bearing a mace, with the discus in hand, in Thy former form only, having four arms, O thousand-armed, Cosmic Form (Being).",
    "11:47": "11.47 The Blessed Lord said  O Arjuna, this Cosmic Form has graciously been shown to thee by Me by My own Yogic power; full of splendour, primeval, and infinite, this Cosmic Form of Mine has never been seen before by anyone other than thyself.",
    "11:48": "11.48 Neither by the study of the Vedas and sacrifices, nor by gifts nor by rituals nor by severe austerities can I be seen in this form in the world of men by any other than thyself, O great hero of the Kurus (Arjuna).",
    "11:49": "11.49 Be not afraid, nor bewildered on seeing such a teriible form of Mine as this; with thy fear dispelled and with a gladdened heart, now behold again this former form of Mine.",
    "11:50": "11.50 Sanjaya said  Having thus spoken to Arjuna, Krishna again showed His own form and the great Soul (Krishna), assuming His gentle form, consoled him (Arjuna) who was terrified.",
    "11:51": "11.51 Arjuna said  Having seen this Thy gentle human form, O Krishna, now I am composed and am restored to my own nature.",
    "11:52": "11.52 The Blessed Lord said  Very hard indeed it is to see this form of Mine which thou hast seen. Even the gods are ever longing to behold it.",
    "11:53": "11.53 Neither by the Vedas nor by austerity, nor by gift, nor by sacrifice can I be seen in this form as thou hast seen Me (so easily).",
    "11:54": "11.54 But by single-minded devotion can I, of this Form, be known and seen in reality and also entered into, O Arjuna.",
    "11:55": "11.55 He who does all actions for Me, who looks upon Me as the Supreme, who is devoted to Me, who is free from attachment, who bears enmity towards no creature, he comes to Me, O Arjuna.",
    "12:1": "12.1 Arjuna said  Those devotees who, ever steadfast, thus worship Thee and those also who worship the imperishable and the unmanifested  which of them are better versed in Yoga?",
    "12:2": "12.2 The Blessed Lord said  Those who, fixing their mind on Me, worship Me, ever steadfast and endowed with supreme faith, are the best in Yoga in My opinion.",
    "12:3": "12.3 Those who worship the imperishable, the indefinable, the unmanifest, the omnipresent, the unthinkable, the immovable and the eternal.",
    "12:4": "12.4 Having restrained all the senses, even-minded everywhere, intent on the welfare of all beings  verily they also come unto Me.",
    "12:5": "12.5 Greater is their trouble whose minds are set on the unmanifested; for the goal; the unmanifested, is very hard for the embodied to reach.",
    "12:6": "12.6 But to those who worship Me, renouncing all actions in Me, regarding Me as the supreme gaol, meditating on Me with single-minded Yoga.",
    "12:7": "12.7 To those whose minds are set on Me, O Arjuna, verily I become ere long the saviour out of the ocean of Samsara.",
    "12:8": "12.8 Fix thy mind in Me only, thy intellect in Me, (then) thou shalt no doubt live in Me alone hereafter.",
    "12:9": "12.9 If thou art unable to fix thy mind steadily on Me, then by the Yoga of constant practice do thou seek to reach Me, O Arjuna.",
    "12:10": "12.10 If thou art unable to practise even this Abhyasa Yoga, be thou intent on doing actions for My sake; even by doing actions for My sake, thou shalt attain perfection.",
    "12:11": "12.11 If thou art unable to do even this, then, resorting to union with Me, renounce the fruits of all actions with the self controlled.",
    "12:12": "12.12 Better indeed is knowledge than practice; than knowledge meditation is better; than meditation the renunciation of the fruits of actions: peace immediately follows renunciation.",
    "12:13": "12.13 He who hates no creature, who is friendly and compassionate to all, who is free from attachment and egoism, balanced in pleasure and pain, and forgiving.",
    "12:14": "12.14 Ever content, steady in meditation, self-controlled, possessed of firm conviction, with the mind and intellect dedicated to Me, he, My devtoee, is dear to Me.",
    "12:15": "12.15 He by whom the world is not agitated and who cannot be agitated by the world, and who is freed from joy, anger, fear and anxiety  he is dear to Me.",
    "12:16": "12.16 He who is free from wants, pure, expert, unconcerned, and free from pain, renouncing all undertakings or commencements  he who is (thus) devoted to Me, is dear to Me.",
    "12:17": "12.17 He who neither rejoices, nor hates, nor grieves, nor desires, renouncing good and evil, and who is full of devotion, is dear to Me.",
    "12:18": "12.18 He who is the same to foe and friend, and also in honour and dishonour, who is the same in cold and heat and in pleasure and pain, who is free from attachment.",
    "12:19": "12.19 He to whom censure and praise are eal, who is silent, content with anything, homeless, of a steady mind, and full of devotion  that man is dear to Me.",
    "12:20": "12.20 They verily who follow this immortal Dharma (law or doctrine) as described above, endowed with faith, regarding Me as their supreme goal, they, the devotees, are exceedingly dear to Me.",
    "13:1": "13.1 Arjuna said  I wish to learn about Nature (matter) and the Spirit (soul), the field and the knower of the field, knowledge and that which ought to be known, O Kesava.",
    "13:2": "13.2 The Blessed Lord said  This body, O Arjuna, is called the field; he who knows it is called the knower of the field, by those who know of them.",
    "13:3": "13.3 Do thou also know Me as the knower of the field in all fields, O Arjuna. Knowledge of both the field and the knower of the field is considered by Me to be the knowledge.",
    "13:4": "13.4 What the field is and of what nature, what are its modifications and whence it is and also who He is and what His powers are  hear all that from Me in brief.",
    "13:5": "13.5 Sages have sung in many ways, in various distinctive chants and also in the suggestive words indicative of the Absolute, full of reasoning and decisive.",
    "13:6": "13.6 The great elements, egoism, intellect, and also the Unmanifested Nature, the ten senses and one (mind), and the five objects of the senses.",
    "13:7": "13.7 Desire, hatred, pleasure, pain, the aggregate (the body), intelligence, fortitude  the field has thus been briefly described with its modifications.",
    "13:8": "13.8 Humility, unpretentiousness, non-injury, forgiveness, uprightness, service of the teacher, purity, steadfastness, self-control.",
    "13:9": "13.9 Indifference to the objects of the senses and also absence of egoism; perception of (or reflection on) the evil in birth, death, old age, sickness and pain.",
    "13:10": "13.10 Non-attachment, non-identification of the Self with son, wife, home and the rest, and constant even-mindedness on the attainment of the desirable and the undesirable.",
    "13:11": "13.11 Unswerving devotion unto Me by the Yoga of non-separation, resort to solitary places, distaste for the society of men.",
    "13:12": "13.12 Constancy in Self-knowledge, perception of the end of true knowledge  this is declared to be knowledge, and what is opposed to it is ignorance.",
    "13:13": "13.13 I will declare that which has to be known, knowing which one attains to immortality, the beginningless supreme Brahman, called neither being nor non-being.",
    "13:14": "13.14 With hands and feet everywhere, with eyes, heads and mouths everywhere, with ears everywhere, He exists in the worlds enveloping all.",
    "13:15": "13.15 Shining by the functions of all the senses, yet without the senses; unattached, yet supporting all; devoid of alities, yet their experiencer.",
    "13:16": "13.16 Without and within (all) beings the unmoving and also the moving; because of Its subtlety, unknowable; and near and far away is That.",
    "13:17": "13.17 And undivided, yet It exists as if divided in beings; It is to be known as the supporter of being; It devours and It generates.",
    "13:18": "13.18 That, the Light of all lights, is said to be beyond darkness: knowledge, the knowable and the goal of knowledge, seated in the hearts of all.",
    "13:19": "13.19 Thus the field, as well as knowledge and the knowable have been briefly stated. My devotee, knowing this, enters into My Being.",
    "13:20": "13.20 Know thou that Nature (matter) and the Spirit are both beginningless; and know also that all modifications and alities are born of Nature.",
    "13:21": "13.21 In the production of the effect and the cause, Nature (matter) is said to be the cause; in the experience of pleasure and pain, the soul is said to be the cause.",
    "13:22": "13.22 The soul seated in Nature experiences the alities born of Nature; attachment to the alities is the cause of its birth in good and evil wombs.",
    "13:23": "13.23 The Supreme Soul in this body is also called the spectator, the permitter, the supporter, the enjoyer, the great Lord and the Supreme Self.",
    "13:24": "13.24 He who thus knows the Spirit and Matter together with the alities, in whatever condition he may be, he is not born again.",
    "13:25": "13.25 Some by meditation behold the Self in the self by the self, others by the Yoga of knowledge, and still others by the Yoga of action.",
    "13:26": "13.26 Others also, not knowing thus, worship, having heard of It from others; they, too, cross beyond death, regarding what they have heard as the Supreme refuge.",
    "13:27": "13.27 Wherever a being is born, whether unmoving or moving, know thou, O best of the Bharatas (Arjuna), that it is from the union between the field and its knower.",
    "13:28": "13.28 He sees, who sees the Supreme Lord, existing eally in all beings, the unperishing within the perishing.",
    "13:29": "13.29 Because he who sees the same Lord eally dwelling everywhere does not destroy the Self by the self; he goes to the highest goal.",
    "13:30": "13.30 He sees, who sees that all actions are performed by Nature alone and that the Self is actionless.",
    "13:31": "13.31 When a man sees the whole variety of beings as resting in the One, and spreading forth from That alone, he then becomes Brahman.",
    "13:32": "13.32 Being without beginning and being devoid of (any) alities, the Supreme Self, imperishable, though dwelling in the body, O Arjuna, neither acts nor is tainted.",
    "13:33": "13.33 As the all-pervading ether is not tainted, because of its subtlety, so the Self seated everywhere in the body is not tainted.",
    "13:34": "13.34 Just as the one sun illumines the whole world, so also the Lord of the field (Supreme Self) \nillumines the whole field, O Arjuna.",
    "13:35": "13.35 They who, by the eye of knowledge, perceive the distinction between the field and its knower and also the liberation from the Nature of being, go to the Supreme.",
    "14:1": "14.1 The Blessed Lord said  I will again declare (to thee) that supreme knowledge, the best of all knowledge, having known which all the sages have gone to the supreme perfection after this life.",
    "14:2": "14.2 They who, having taken refuge in this knowledge, have attained to unity with Me, are neither born at the time of creation nor are they disturbed at the time of dissolution.",
    "14:3": "14.3 My womb is the great Brahma; in that I place the germ; thence, O Arjuna, is the birth of all beings.",
    "14:4": "14.4 Whatever forms are produced, O Arjuna, in any womb whatsoever, the great Brahma is their womb and I am the seed-giving father.",
    "14:5": "14.5 Purity, passion and inertia  these alities, O Arjuna, born of Nature, bind fast in the body, the embodied, the indestructible.",
    "14:6": "14.6 Of these, Sattva, which from its stainlessness is luminous and healthy, binds by attachment to happiness and by attachment to knowledge, O sinless one.",
    "14:7": "14.7 Know thou Rajas to be of the nature of passion, the source of thirst (for sensual enjoyment) and attachment; it binds fast, O Arjuna, the embodied one by attachment to action.",
    "14:8": "14.8 But know thou Tamas to be born of ignorance, deluding all embodied beings; it binds fast, O Arjuna, by heedlessness, indolence and sleep.",
    "14:9": "14.9 Sattva attaches to happiness, Rajas to action, O Arjuna, while Tamas verily shrouding knowledge attaches to heedlessness.",
    "14:10": "14.10 Now Sattva arises (prevails), O Arjuna, having overpowered Rajas and Tamas; nor Rajas, having overpowered Sattva and Tamas; and now Tamas, having overpowered Sattva and Rajas.",
    "14:11": "14.11 When through every gate (sense) in this body, the wisdom-light shines, then it may be known that Sattva is predominant.",
    "14:12": "14.12 Greed, activity, the undertaking of actions, restlessness, longing  these arise when Rajas is predominant, O Arjuna.",
    "14:13": "14.13 Darkness, inertness, heedlessness and delusion  these arise when Tamas is predominant, O Arjuna.",
    "14:14": "14.14 If the embodied one meets with death when Sattva is predominant, then he attains to the spotless worlds of the knowers of the Highest.",
    "14:15": "14.15 Meeting death in Rajas, he is born among those who are attached to action; and dying in Tamas, he is born in the womb of the senseless.",
    "14:16": "14.16 The fruit of good action, they say, is Sattvic and pure, verily the fruit of Rajas is pain, and ignorance is the fruit of Tamas.",
    "14:17": "14.17 From Sattva arises knowledge, and greed from Rajas; heedlessness and delusion arise from Tamas, and also ignorance.",
    "14:18": "14.18 Those who are seated in Sattva go upwards; the Rajasic dwell in the middle; and the Tamasic, abiding in the function of the lowest Guna, go downwards.",
    "14:19": "14.19 When the seer beholds no agent other than the Gunas and knows That which is higher than they, he attains to My Being.",
    "14:20": "14.20 The embodied one having crossed beyond these three Gunas out of which the body is evolved, is freed from birth, death, decay and pain, and attains to immortality.",
    "14:21": "14.21 Arjuna said  What are the marks of him who has transcended the three alities, O Lord? What is his conduct and how does he go beyond these three alities?",
    "14:22": "14.22 The Blessed Lord said  When light, activity and delusion are present, he hates them not, nor does he long for them when they are absent.",
    "14:23": "14.23 He who, seated like one unconcerned, is not moved by the alities, and who, knowing that the alities are active, is self-centred and moves not.",
    "14:24": "14.24 Who is the same in pleasure and pain, who dwells in the Self, to whom a clod of earth, stone and gold are alike, who is the same to the dear and the unfriendly, who is firm, and to whom censure and praise are as one.",
    "14:25": "14.25 Who is the same in honour and dishonour, the same to friend and foe, abandoning all undertakings  he is said to have transcended the alities.",
    "14:26": "14.26 And he who serves Me with unswerving devotion, he, crossing beyond the alities, is fit for becoming Brahman.",
    "14:27": "14.27 For I am the abode of Brahman, the immortal and the immutable, of everlasting Dharma and of absolute bliss.",
    "15:1": "15.1 The Blessed Lord said  They (the wise) speak of the indestructible peepul tree having its root above and branches below, whose leaves are the metres or hymns: he who knows it is a knower of the Vedas.",
    "15:2": "15.2 Below and above spread its branches, nourished by the Gunas; sense-objects are its buds; and below, in the world of men, stretch forth the roots, originating action.",
    "15:3": "15.3 Its form is not perceived here as such, neither its end nor its origin, nor its foundation nor resting place: having cut asunder this firmly rooted peepul tree with the strong axe of non-attachment.",
    "15:4": "15.4 Then That goal should be sought for, whither having gone none returns again. I seek refuge in that Primeval Purusha Whence streamed forth the ancient activity or energy.",
    "15:5": "15.5 Free from pride and delusion, victorious over the evil of attachment, dwelling constantly in the Self, their desires having completely turned away, freed from the pairs of opposites known as pleasure and pain, the undeluded reach the eternal goal.",
    "15:6": "15.6 Neither doth the sun illumine there nor the moon, nor the fire; having gone thither they return not; that is My supreme abode.",
    "15:7": "15.7 An eternal portion of Myself having become a living soul in the world of life, draws to (itself) the (five) senses with the mind for the sixth, abiding in Nature.",
    "15:8": "15.8 When the Lord (as the individual soul) obtains a body and when He leaves it, He takes these and goes (with them) as the wind takes the scents from their seats (flowers, etc.).",
    "15:9": "15.9 Presiding over the ear, the eye, touch, taste and smell, as well as the mind, it enjoys the objects of the senses.",
    "15:10": "15.10 The deluded do not see Him Who departs, stays and enjoys; but they who possess the eye of knowledge behold Him.",
    "15:11": "15.11 The Yogins striving (for perfection) behold Him dwelling in the Self; but, the unrefined and unintelligent, even though striving, see Him not.",
    "15:12": "15.12 That light which residing in the sun illumines the whole world, that which is in the moon and in the fire  know that light to be Mine.",
    "15:13": "15.13 Permeating the earth I support all beings by (My) energy; and having become the watery moon I nourish all herbs.",
    "15:14": "15.14 Having become the fire Vaisvanara, I abide in the body of living beings and, associated with the Prana and the Apana, digest the fourfold food.",
    "15:15": "15.15 And I am seated in the hearts of all; from Me are memory and knowledge, as well as their absence. I am verily That which has to be known by all the Vedas; I am indeed the author of the Vedanta and the knower of the Vedas am I.",
    "15:16": "15.16 Two Purushas there are in this world, the perishable and the imperishable. All beings are \nthe perishable and the Kutastha  the unchanging  is called the imperishable.",
    "15:17": "15.17 But distinct is the Supreme Purusha called the highest Self, the indestructible Lord Who, pervading the three worlds, sustains them.",
    "15:18": "15.18 As I transcend the perishable and am even higher than the imperishable, I am declared to be the highest Purusha in the world and in the Vedas.",
    "15:19": "15.19 He who, undeluded, knows Me thus as the highest Purusha, he, knowing all, worships Me with his whole being (heart), O Arjuna.",
    "15:20": "15.20 Thus, this most secret science has been taught by Me, O sinless one; on knowing this, a man becomes wise, and all his duties are accomplished, O Arjuna.",
    "16:1": "16.1 The Blessed Lord said  Fearlessness, purity of heart, steadfastness in knowledge and Yoga, almsgiving, control of the senses, sacrifice, study of scriptures, austerity and straightforwardness.",
    "16:2": "16.2 Harmlessness, truth, absence of anger, renunciation, peacefulness, absence of crookedness, compassion towards beings, non-covetousness, gentleness, modesty, absence of fickleness.",
    "16:3": "16.3 Vigour, forgiveness, fortitude, purity, absence of hatred, absence of pride  these belong to the one born for a divine state, O Arjuna.",
    "16:4": "16.4 Hypocrisy, arrogance and self-conceit, anger and also harshness and ignorance, belong to one who is born for a demoniacal state, O Partha (Arjuna).",
    "16:5": "16.5 The divine nature is deemed conducive to liberation, and the demoniacal to bondage. Grieve not, O Arjuna, thou art born with divine endowments.",
    "16:6": "16.6 There are two types of beings in this world, the divine and the demoniacal; the divine has been described at length; hear from Me, O Arjuna, of the demoniacal.",
    "16:7": "16.7 The demoniacal know not what to do and what to refrain from; neither purity, nor right conduct nor truth is found in them.",
    "16:8": "16.8 They say, \"This universe is without truth, without (moral) basis, without a God, brought about by mutual union, with lust for its cause; what else?\"",
    "16:9": "16.9 Holding this view, these ruined souls of small intellect and fierce deeds, come forth as the enemies of the world for its destruction.",
    "16:10": "16.10 Filled with insatiable desires, full of hypocrisy, pride and arrogance, holding evil ideas through delusion, they work with impure resolves.",
    "16:11": "16.11 Giving themselves over to immeasurable cares ending only with death, regarding gratification of lust as their highest aim, and feeling sure that that is all.",
    "16:12": "16.12 Bound by a hundred ties of hope, given over to lust and anger, they strive to obtain by unlawful means hoards to wealth for sensual enjoyments.",
    "16:13": "16.13 \"This has been gained by me today; this desire of mine I shall fuffil; this is mine and this wealth also shall be mine in future.\"",
    "16:14": "16.14 \"That enemy has been slain by me; and others also I shall slay. I am the lord. I enjoy. I am perfect, powerful and happy.\"",
    "16:15": "16.15 \"I am rich and born in a noble family. Who else is equal to me? I shall perform sacrifices. I shall give (charity). I shall rejoice,\" thus deluded by ignorance.",
    "16:16": "16.16 Bewildered by many a fancy, entangled in the snare of delusion, addicted to the gratification of lust, they fall into a foul hell.",
    "16:17": "16.17 Self-conceited, stubborn, filled with the pride and intoxication of wealth, they perform sacrifices in name out of ostentation, contrary to scriptural ordinances.",
    "16:18": "16.18 Given over to egoism, power, haughtiness, lust and anger, these malicious people hate Me in their own bodies and in those of others.",
    "16:19": "16.19 Those cruel haters, worst among men in the world, I hurl those evil-doers into the wombs of demons only.",
    "16:20": "16.20 Entering into demoniacal wombs and deluded, birth after birth, not attaining Me, they thus fall, O Arjuna, into a condition still lower than that.",
    "16:21": "16.21 Triple is the gate of this hell, destructive of the self  lust, anger and greed; therefore one should abandon these three.",
    "16:22": "16.22 A man who is liberated from these three gates to darkness, O Arjuna, practises what is good for him and thus goes to the Supreme Goal.",
    "16:23": "16.23 He who, having cast aside the ordinances of the scriptures, acts under the impulse of desire, attains not perfection, nor happiness nor the Supreme Goal.",
    "16:24": "16.24 Therefore, let the scripture be thy authority in determining what ought to be done and what ought not to be done. Having known what is said in the ordinance of the scriptures, thou shouldst act here in this world.",
    "17:1": "17.1 Arjuna said  Those who, setting aside the ordinances of the scriptures, perform sacrifice with faith, what is their condition, O Krishna? Is is Sattva, Rajas or Tamas?",
    "17:2": "17.2 The Blessed Lord said  Threefold is the faith of the embodied, which is inherent in their nature  the Sattvic (pure), the Rajasic (passionate) and the Tamasic (dark). Do thou hear of it.",
    "17:3": "17.3 The faith of each is in accordance with his nature, O Arjuna. The man consists of his faith; as a man's faith is, so is he.",
    "17:4": "17.4 The Sattvic or the pure men worship the gods; the Rajasic or the passionate worship the Yakshas and the Rakshasas; the others (the Tamasic or the deluded people) worship the ghosts and the hosts of the nature-spirits.",
    "17:5": "17.5 Those men who practise terrific austerities not enjoined by the scriptures, given to hypocrisy and egoism, impelled by the force of lust and attachment.",
    "17:6": "17.6 Senseless, torturing all the elements in the body and Me also, Who dwell in the body,  know thou these to be of demonical resolves.",
    "17:7": "17.7 The food also which is dear to each is threefold, as also sacrifice, austerity and almsgiving. Hear thou the distinction of these.",
    "17:8": "17.8 The foods which increase life, purity, strength, health, joy and cheerfulness (good appetite), which are savoury and oleaginous, substantial and agreeable, are dear to the Sattvic (pure) people.",
    "17:9": "17.9 The foods that are bitter, sour, saline, excessively hot, pungent, dry and burning, are liked by the Rajasic and are productive of pain, grief and disease.",
    "17:10": "17.10 That which is state, tasteless, putrid, rotten, refuse and impure, is the food liked by the Tamasic.",
    "17:11": "17.11 That sacrifice which is offered by men without desire for reward as enjoined by the ordinance (scripture), with a firm faith that to do so is a duty, is Sattvic or pure.",
    "17:12": "17.12 The sacrifice which is offered, O Arjuna, seeking a reward and for ostentation, know thou that to be a Rajasic Yajna.",
    "17:13": "17.13 They declare that sacrifice to be Tamasic which is contrary to the ordinances of the scriptures, in which no food is distributed, which is devoid of Mantras, gifts and faith.",
    "17:14": "17.14 Worship of the gods, the twice-born, the teachers and the wise, purity, straightforwardness, celibacy and non-injury are called the austerities of the body.",
    "17:15": "17.15 Speech which causes no excitement, truthful, pleasant and beneficial, the practice of the study of the Vedas, are called austerity of speech.",
    "17:16": "17.16 Serenity of mind, good-heartedness, self-control, purity of nature  this is called mental austerity.",
    "17:17": "17.17 This threefold austerity, practised by steadfast men, with the utmost faith, desiring no reward, they call Sattvic.",
    "17:18": "17.18 The austerity which is practised with the object of gaining good reception, honour and worship, and with hypocrisy, is here said to be Rajasic, unstable and transitory.",
    "17:19": "17.19 That austerity which is practised out of a foolish notion, with self-torture, or for the purpose of destroying another, is declared to be Tamasic.",
    "17:20": "17.20 That gift which is given to one who does nothing in return, knowing it to be a duty to give in a fit place and time to a worthy person, that gift is held to be Sattvic.",
    "17:21": "17.21 And, that gift which is given with a view to receive something in return, or looking for a reward, or reluctantly, is held to be Rajasic.",
    "17:22": "17.22 The gift that is given at a wrong place and time, to unworthy persons, without respect or with insult is declared to be Tamasic.",
    "17:23": "17.23 \"Om Tat Sat\": This has been declared to be the triple designation of Brahman. By that were created formerly, the Brahmanas, the Vedas and the sacrifices.",
    "17:24": "17.24 Therefore, with the utterance of \"Om\" are the acts of sacrifice, gift and austerity as enjoined in the scriptures, always begun by the students of Brahman.",
    "17:25": "17.25 Uttering ï1Tatï1, without aiming at the fruits, are the acts of sacrifice and austerity and the various acts of gifts performed by the seekers of liberation.",
    "17:26": "17.26 The word ï1Satï1 is used in the sense of reality and of goodness; and so also, O Arjuna, the word ï1Satï1 is used in the sense of an auspicious act.",
    "17:27": "17.27 Steadfastness in sacrifice, austerity and gift, is also called 'Sat' and also action in connection with these (or for the sake of the Supreme) is called 'Sat'.",
    "17:28": "17.28 Whatever is sacrificed, given or performed, and whatever austerity is practised without faith, it is called 'Asat', O Arjuna; it is naught here or hereafter (after death).",
    "18:1": "18.1 Arjuna said  I desire to know severally, O mighty-armed, the essence or truth of renunciation, O Hrishikesa, as also of abandonment, O slayer of Kesi.",
    "18:2": "18.2 The Blessed Lord said  The sages understand Sannyasa to be the renunciation of action with desire; the wise declare the abandonment of the fruits of all actions as Tyaga.",
    "18:3": "18.3 Some philosophers declare that actions should be abandoned as an evil; while others (declare) that acts of sacrifice, gift and austerity should not be relinished.",
    "18:4": "18.4 Hear from Me the conclusion or the final truth about this abandonment, O best of the Bharatas; abandonment, verily, O best of men, has been declared to be of three kinds.",
    "18:5": "18.5 Acts of sacrifice, gift and austerity should not be abandoned, but should be performed; sacrifice, gift and also austerity are the purifiers of the wise.",
    "18:6": "18.6 But even these actions should be performed leaving aside attachment and the desire for rewards, O Arjuna; this is My certain and best conviction.",
    "18:7": "18.7 Verily the renunciation of obligatory action is not proper; the abandonment of the same from delusion is declared to be Tamasic.",
    "18:8": "18.8 He who abandons action on account of the fear of bodily trouble (because it is painful), does not obtain the merit of renunciation by doing such Rajasic renunciation.",
    "18:9": "18.9 Whatever obligatory action is done, O Arjuna, merely because it ought to be done, abandoning attachment and also the desire for reward, that renunciation is regarded as Sattvic (pure).",
    "18:10": "18.10 The man of renunciation, pervaded by purity, intelligent, and with his doubts cut asunder, does not hate a disagreeable work nor is he attached to an agreeable one.",
    "18:11": "18.11 Verily, it is not possible for an embodied being to abandon actions entirely; but he who relinishes the rewards of actions is verily called a man of renunciation.",
    "18:12": "18.12 The threefold fruit of action (evil, good and mixed) accrues after death to the non-abandoners, but never to the abandoners.",
    "18:13": "18.13 Learn from Me, O mighty-armed Arjuna, these five causes as declared in the Sankhya system for the accomplishment of all actions.",
    "18:14": "18.14 The seat (body), the doer, the various senses, the different functions of various sorts, and the presiding deity, also, the fifth.",
    "18:15": "18.15 Whatever action a man performs with his body, speech and mind  whether right or the reverse  these five are its causes.",
    "18:16": "18.16 Now, such being the case, verily he who  owing to untrained understanding  looks upon his Self, which is isolated, as the agent, he of perverted intelligence, sees not.",
    "18:17": "18.17 He who is free from the egoistic notion, whose intelligence is not tainted (by good or evil), \nthough he slays these people, he slayeth not, nor is he bound (by the action).",
    "18:18": "18.18 Knowledge, the knowable and the knower form the threefold impulse to action; the organ, the action and the agent form the threefold basis of action.",
    "18:19": "18.19 Knowledge, action and actor are declared in the science of the Gunas (Sankhya philosophy) to be of three kinds only, according to the distinction of the Gunas. Of these also, hear duly.",
    "18:20": "18.20 That by which one sees the one indestructible Reality in all beings, not separate in all the separate beings  know thou that knowledge to be Sattvic.",
    "18:21": "18.21 But that knowledge which sees in all beings various entities of distinct kinds as different from one another  know thou that knowledge to be Rajasic.",
    "18:22": "18.22 But that which clings to one single effect as if it were the whole, without reason, without foundation in Truth, and trivial  that is declared to be Tamasic.",
    "18:23": "18.23 An action which is ordained, which is free from attachment, and which is done without love or hatred by one who is not desirous of any reward  that action is declared to be Sattvic.",
    "18:24": "18.24 But that action which is done by one longing for the fulfilment of desires or gain with egoism or with much effort  that is declared to be Rajasic (passionate).",
    "18:25": "18.25 That action which is undertaken from delusion, without a regard for the conseences, loss, injury and (one's own) ability  that is declared to be Tamasic (dark).",
    "18:26": "18.26 An agent who is free from attachment, non-egoistic, endowed with firmness and enthusiasm, and unaffected by success or failure, is called Sattvic (pure).",
    "18:27": "18.27 Passionate, desiring to obtain the reward of actions, greedy, cruel, impure, moved by joy and sorrow, such an agent is said to be Rajasic (passionate).",
    "18:28": "18.28 Unsteady, vulgar, unbending, cheating, malicious, lazy, desponding and procrastinating  such an agent is called Tamasic.",
    "18:29": "18.29 Hear thou the threefold division of intellect and firmness according to the Gunas, as I declare them fully and distinctly, O Arjuna.",
    "18:30": "18.30 The intellect which knows the path of work and renunciation, what ought to be done and what ought not to be done, fear and fearlessness, bondage and liberation  that intellect is Sattvic (pure), O Arjuna.",
    "18:31": "18.31 That, by which one wrongly understands Dharma and Adharma and also what ought to be done and what ought not to be done  that intellect, O Arjuna, is Rajasic (passionate).",
    "18:32": "18.32 That, which, enveloped in darkness, sees Adharma as Dharma and all things perverted  that intellect, O Arjuna, is Tamasic (dark).",
    "18:33": "18.33 The unwavering firmness by which, through Yoga, the functions of the mind, the life-force and the senses are restrained  that firmness, O Arjuna, is Sattvic (pure).",
    "18:34": "18.34 But that, O Arjuna, by which, on account of attachment and desire for reward, one holds fast to Dharma (duty), enjoyment of pleasures and earning of wealth  that firmness, O Arjuna, is Rajasic (passionate).",
    "18:35": "18.35 That, by which a stupid man does not abandon sleep, fear, grief, despair and also conceit  that firmness, O Arjuna, is Tamasic.",
    "18:36": "18.36 And now hear from Me, O Arjuna, of the threefold pleasure, in which one rejoices by practice and surely comes to the end of pain.",
    "18:37": "18.37 That which is like poison at first but in the end like nectar  that happiness is declared to be Sattvic, born of the purity of one's own mind due to Self-realisation.",
    "18:38": "18.38 That happiness which arises from the contact of the sense-organs with the objects, which is at first like nectar, and in the end like poison  that is declared to be Rajasic.",
    "18:39": "18.39 That happiness which at first as well as in the seel deludes the self, and which arises from sleep, indolence and heedlessness  that is declared to be Tamasic.",
    "18:40": "18.40 There is no being on earth or again in heaven among the gods, that is liberated from the three alities born of Nature.",
    "18:41": "18.41 Of Brahmanas, Kshatriyas and Vaisyas, as also of Sudras, O Arjuna, the duties are distributed according to the alities born of their own nature.",
    "18:42": "18.42 Serenity, self-restraint, austerity, purity, forgiveness and also uprightness, knowledge, realisation and belief in God are the duties of the Brahmanas, born of (their own) nature.",
    "18:43": "18.43 Prowess, splendour, firmness, dexterity and also not fleeing from battle, generosity and lordliness are the duties of the Kshatriyas, born of (their own) nature.",
    "18:44": "18.44 Agriculture, cattle-rearing and trade are the duties of the Vaisya (merchant), born of (their own) nature; and action consisting of service is the duty of the Sudra (servant-class), born of (their own) nature.",
    "18:45": "18.45 Each man devoted to his own duty attains perfection. How he attains perfection while being engaged in his own duty, hear now.",
    "18:46": "18.46 He from Whom all the beings have evolved and by Whom all this is pervaded  worshipping Him with his own duty, man attains perfection.",
    "18:47": "18.47 Better is one's own duty (though) destitute of merits, than the duty of another well performed. He who does the duty ordained by his own nature incurs no sin.",
    "18:48": "18.48 One should not abandon, O Arjuna, the duty to which one is born, though faulty; for, all undertakings are enveloped by evil, as fire by smoke.",
    "18:49": "18.49 He whose intellect is unattached everywhere, who has subdued his self, from whom desire has fled,  he by renunciation, attains the supreme state of freedom from action.",
    "18:50": "18.50 Learn from Me in brief, O Arjuna, how he who has attained perfection reaches Brahman (the Eternal), that supreme state of knowledge.",
    "18:51": "18.51 Endowed with a pure intellect, controlling the self by firmness, relinishing sound and other objects and abandoning attraction and hatred.",
    "18:52": "18.52 Dwelling in solitude, eating but little, with speech, body and mind subdued, always engaged in meditation and concentration, resorting to dispassion.",
    "18:53": "18.53 Having abandoned egoism, strength, arrogance, desire, anger and covetousness, and free from the notion of 'mine' and peaceful,  he is fit for becoming Brahman.",
    "18:54": "18.54 Becoming Brahman, serene in the Self, he neither grieves nor desires, the same to all beings, he obtains supreme devotion to Me.",
    "18:55": "18.55 By devotion he knows Me in truth, what and who I am; then having known Me in truth, he forthwith enters into the Supreme.",
    "18:56": "18.56 Doing all actions always having taken refuge in Me, by My grace he obtains the eternal indestructible state of being.",
    "18:57": "18.57 Mentally renouncing all actions in Me, having Me as the highest goal, resorting to the Yoga of discrimination do thou ever fix thy mind on Me.",
    "18:58": "18.58 Fixing thy mind on Me, thou shalt by My grace overcome all obstacles; but if from egoism thou wilt not hear Me, thou shalt perish.",
    "18:59": "18.59 If, filled with egoism, thou thinkest: \"I will not fight\", vain is this, thy resolve; Nature will compel thee.",
    "18:60": "18.60 O Arjuna, bound by thy own Karma (action) born of thy own nature, that which from delusion thou wishest not to do, even that thou shalt do helplessly.",
    "18:61": "18.61 The Lord dwells in the hearts of all beings, O Arjuna, causing all beings, by His illusive power, to revolve as if mounted on a machine.",
    "18:62": "18.62 Fly unto Him for refuge with all thy being, O Arjuna; by His grace thou shalt obtain supreme peace (and) the eternal abode.",
    "18:63": "18.63 Thus has wisdom, more secret than secrecy itself, been declared unto thee by Me; having reflected over it fully, then act as thou wishest.",
    "18:64": "18.64 Hear thou again My supreme word, most secret of all; because thou art dearly beloved of Me, I will tell thee what is good.",
    "18:65": "18.65 Fix thy mind on Me, by devoted to Me, sacrifice to Me, bow down to Me. Thou shalt come even to Me; truly do I promise unto thee, (for) thou art dear to Me.",
    "18:66": "18.66 Abandoning all duties, take refuge in Me alone: I will liberate thee from all sins; grieve not.",
    "18:67": "18.67 This is never to be spoken by thee to one who is devoid of austerities or devotion, nor to one who does not render service or who does not desire to listen, nor to one who cavils at Me.",
    "18:68": "18.68 He who with supreme devotion to Me will teach this supreme secret to My devotees, shall doubtlessly come to Me.",
    "18:69": "18.69 Nor is there any among men who does dearer service to Me, nor shall there be another on earth dearer to Me than he.",
    "18:70": "18.70 And he who will study this sacred dialogue of ours, by him I shall have been worshipped by the sacrifice of wisdom,  such is My conviction.",
    "18:71": "18.71 Also the man who hears this, full of faith and free from malice, he, too, liberated, shall attain to the happy worlds of those of righteous deeds.",
    "18:72": "18.72 Has this been heard, O Arjuna, with one-pointed mind? Has the delusion of thy ignorance been destroyed, O Dhananjaya?",
    "18:73": "18.73 Arjuna said  Destroyed is my delusion as I have gained my knowledge (memory) through Thy grace, O Krishna. I remain freed from doubts. I will act according to Thy word.",
    "18:74": "18.74 Sanjaya said  Thus I have heard this wonderful dialogue between Krishna and the high-souled Arjuna, which causes the hair to stand on end.",
    "18:75": "18.75 Through the grace of Vyasa I have heard this supreme and most secret Yoga direct from Krishna, the Lord of Yoga, Himself declaring it.",
    "18:76": "18.76 O King, remembering this wonderful and holy dialogue between Krishna and Arjuna, I rejoice again and again.",
    "18:77": "18.77 And, remembering again and again, also that most wonderful form of Hari, great is my wonder, O King; and I rejoice again and again.",
    "18:78": "18.78 Wherever is Krishna, the Lord of Yoga; wherever is Arjuna, the wielder of the bow; there are prosperity, victory, happiness and firm policy; such is my conviction."
}